{"_default": {"1": {"ID": "fb480ae1-46c4-44e5-bc88-c60308e42528", "url": "https://www.nyfa.org/Opportunities/Show/fb480ae1-46c4-44e5-bc88-c60308e42528", "Title": "20/92 Video Festival at Icebox Project Space", "Organization": "Icebox Project Space", "Website": "http://iceboxprojectspace.com/20-92-annual-video-festival/", "Country": "United States", "Location": "Philadelphia, PA", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "Film/Video/Media", "Application Fee": "$15.00", "Application Deadline": "02/24/2019", "Application Instructions": "Visit us online at:\r\nhttp://iceboxprojectspace.com/20-92-annual-video-festival/\r\nFor full application instructions", "Description": "The 20/92 Video Festival, now in its fifth year, presents collected short videos curated form a national open-call and screened at an immersive scale over the course of a week.  20/92 is unlike any other video festival, as the Icebox Project Space is one of the largest exhibition spaces Philadelphia at nearly 3,500 sq.ft. and has a dedicated projection system which allows for a continuous image to be cast upon its eastern and northern walls, at a maximum size of 20’ x 92’. \r\n \r\nThere is no yearly theme, but we are a project space, and our mission is dedicated to artists who push against something, whether it is oppressive institutions, construction of identity, or even the creative process itself. \r\n \r\nThis year we are looking for video shorts with a maximum run time of 15 minutes. All video ratios (4:3, 16:9, multi-video) are accepted and we encourage artists to explore the unique projection layout and scale.\r\n \r\nYour submission supports our year-long programming focused on collaboration, experimentation, and opportunity.  Submissions are juried by Icebox directors Timothy Belknap and Ryan McCartney, and all participating artists will be provided with still image documentation. \r\n \r\nSubmission Deadline - February 24th\r\nNotification – February 28th\r\nOpening Reception – March 14th  // 6 – 9pm\r\nScreening – March 15th – 17th  // 12 - 6pm\r\n\r\nhttp://iceboxprojectspace.com/20-92-annual-video-festival/", "timestamp": "2019-01-30 09:36:47"}, "2": {"ID": "57a454c6-df3c-432c-9018-ae46f916bde3", "url": "https://www.nyfa.org/Opportunities/Show/57a454c6-df3c-432c-9018-ae46f916bde3", "Title": "treat gallery nyc | satellite art show (austin, tx)", "Organization": "treat gallery new york", "Website": "http://www.treatgallery.org", "Country": "United States", "Location": "Austin, TX", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$15.00", "Application Deadline": "02/24/2019", "Application Instructions": "By paying the application fee, you will be exempt from paying future call for entry fees throughout 2020.  You may submit up to 5 images. Deadline is February 25th, 2019. Please apply by filling out the form below:\r\n\r\nhttps://www.jotform.com/treatgallery/satelliteapplication\r\n\r\nPlease reach out to us directly at info@treatgallery.org with any questions or concerns.", "Description": "Treat gallery, based in New York City, is excited to review your work for consideration for Satellite Art Show during SXSW. Your work would be shown at the fair March 13th - 17th.\r\n\r\nOur treat america project was an elaborate 2018 fundraiser where one user per state took over the @treatamericaproject instagram handle and posted one image a day for a week. Each user selected a state affiliated nonprofit or charity to benefit from sales. The exhibition premiered at Foley Gallery on January 9th, 2019 and will continue to travel.\r\n\r\nYour work will be shown alongside this project (which was curated by Jon Feinstein and Jamie Martinez) along with 3-4 other artists. We are in search of work that touches the idea of America, Americans (conceptually or content-wise) and what that means today.", "timestamp": "2019-01-30 09:36:47"}, "3": {"ID": "6889bcb1-91fd-4443-898f-022ade065527", "url": "https://www.nyfa.org/Opportunities/Show/6889bcb1-91fd-4443-898f-022ade065527", "Title": "Call for Artists and Designers- Azarian McCullough Art Gallery - 2019 - 2020", "Organization": "Azarian McCullough Art Gallery", "Website": "https://stac.edu/amag", "Country": "United States", "Location": "Sparkill, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": " ", "Application Deadline": "04/01/2019", "Application Instructions": "ELIGIBILITY AND TERMS\r\n- Because AMAG serves the educational community of St. Thomas Aquinas College, exhibiting artists agree to meet with our students (on one occasion) at a mutually convenient time to discuss their work. \u2028\u2028\u2028\r\n- Works selected for exhibit must be assigned a dollar value and listed for insurance purposes. AMAG should have this list two weeks prior to delivery.  Works delivered in good condition are insured against loss or damage while in the gallery, from the date of delivery through the last date of retrieval.   (These dates will be specified in a letter of agreement between the artist & AMAG.).  \u2028\u2028\r\n- AMAG inspects all delivered works for damage. AMAG and St. Thomas Aquinas College are not responsible for loss or damage of:  works in transit; works not listed for insurance purposes; works exhibited outside of the gallery; works left in the gallery beyond the last date of retrieval.\u2028\u2028\r\n- Artists must hand deliver and retrieve works. \u2028\u2028\r\n- Delivered works should be ready for hanging and/or installation.   \u2028\u2028\r\n- Artists are responsible for transportation costs to and from the gallery.\u2028\u2028\r\n-  Artists who accept an invitation to exhibit at AMAG, grant AMAG and St. Thomas Aquinas College the right to use images of their work, as well as submitted biographical information, for educational and publicity purposes.\r\n- Artists who sell works while displayed at AMAG, agree to donate 20% of these sales to St. Thomas Aquinas College.  \u2028\u2028\r\n- Artists who accept an invitation to exhibit at AMAG agree upon the specified dates for: delivery, set up, display, reception and retrieval.\r\n- Artists who accept an invitation to exhibit at AMAG will be asked to donate a small work, sketch or example of process to the AMAG Archive to be used in future academic capacities.\r\n\r\nAPPLICATION PROCEDURE\u2028\u2028\r\n\r\nPLEASE SUBMIT\r\nA single, compressed (Reduced Size) PDF with the following: \r\n1.   20 images with titles, dimensions and dates underneath \r\n(It is preferred if the submitted work is representative of the work you would like to exhibit)   \u2028\r\n2.   Contact information \r\n3.   Artist's Statement OR description of proposed exhibition (1-2 pages)\u2028\u2028\r\n4.   CV or Resume indicating exhibition history and education \r\n5.  One page description of how your work could enhance the curriculum of departments outside of art (eg. political science, biology, English, history)\r\nNOTE: Time-based artists can include a link in their submission email to videos online in addition to the above information  \r\nPLEASE SEND MATERIALS TO amag@stac.edu with \r\n2019 – 2020 Submissions in the subject line\r\n\r\nVisit AMAG on the web:  stac.edu/amag", "Description": "The Azarian McCullough Art Gallery invites art and design applications for our 2018 – 2019 exhibition calendar.\r\n\r\nAMAG is located on the campus of St. Thomas Aquinas College in Sparkill N.Y.\u2028\u2028\r\n\r\nArtists in the tri-state area  (NY.NJ.CT.) are eligible. There is no application fee. All media will be considered.\r\n\r\nAMAG assumes the expenses of insurance, the opening and a postcard, handles publicity in the Rockland/Bergen areas and takes a 20%  “commission” on sales  (see below).\r\n\r\nAPPLICATION DEADLINE: April 1, 2019.", "timestamp": "2019-01-30 09:36:47"}, "4": {"ID": "781cec0e-d2b6-450d-bfb4-13b458eb3b09", "url": "https://www.nyfa.org/Opportunities/Show/781cec0e-d2b6-450d-bfb4-13b458eb3b09", "Title": "SATELLITE ART SHOW // SXSW Week // Applications Open", "Organization": "SATELLITE ART SHOW", "Website": "http://www.satellite-show.com", "Country": "United States", "Location": "Austin, TX", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$50.00", "Application Deadline": "02/20/2019", "Application Instructions": "Please fill out the Austin/SXSW Application on our website. You will instructed to submit the $50 application fee upon completion. If you have any questions or trouble uploading images to our platform please reach out to us at: info@satellite-show.com", "Description": "SATELLITE ART SHOW SXSW\r\nMARCH 13 - 17, 2019\r\nAUSTIN, TX\r\n\r\nSATELLITE is a ground breaking art platform which debuted in Miami during Art Basel in 2015 and has now expanded to SXSW week in Austin. We are currently seeking ambitious applications/proposals from Galleries, Curators, Art Collectives, Non Profits and Solo Artists. By fostering a range of programming, SATELLITE is able to offer patrons and collectors with a unique experience where art is at the forefront of creative expression, activism, and curiosity. Our exhibitors are encouraged to provide our visitors both an opportunity to collect new works of art as well as to present exhibitions that are engaging, experiential and interactive. SATELLITE is expanding perceptions on art and community and providing an inclusive environment for guests to feel comfortable in exploration and discovery.\r\n\r\nEXHIBITION PLATFORMS: ($13.30 a square foot)\r\n• 100 sq ft space ($1,400)\r\n• 150 sq ft space ($2,000)\r\n• 200 sq ft space ($2,600)\r\n\r\nOur 2019 SXSW Location is the Museum of Human Achievement which always hosts SXSW events (Jack White's record label has had showcases here). The Museum of Human Achievement is a 7,500 sq foot warehouse with an additional 4,000 square feet of outdoor space. \r\n\r\nSATELLITE has received rave reviews from Hyperallergic, Art Net, Financial Times, Artefuse, Observer, ArtSpace, Galore, Two Coats of Paint, Juxtapoz, Miami New Times, White Hot, Art Zealous, Guest of a Guest, BMore Art, Huffington Post, Playboy, etc.", "timestamp": "2019-01-30 09:36:47"}, "5": {"ID": "be6342a7-8c01-4433-89bc-57ce68618851", "url": "https://www.nyfa.org/Opportunities/Show/be6342a7-8c01-4433-89bc-57ce68618851", "Title": "OPEN CALL: Publication Opportunity for Emerging Artists", "Organization": "Friend of The Artist", "Website": "friendoftheartist.com/application", "Country": "N/A", "Location": " ", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$25.00", "Application Deadline": "03/10/2019", "Application Instructions": "Apply online at friendoftheartist.com/application\r\n\r\nQuestions? Email contact@friendoftheartist.com", "Description": "Publication Opportunity for Emerging Artists\r\n\r\nFOA is a publication dedicated to elevating the work of emerging artists around the world. Our publication releases as a hardcover art book every quarter. It includes the work of artists who work in a variety of mediums, informative articles, and interviews. Accepted artists will have a four page spread of their work, information, and artist statement. Volume 9 will be juried by Alice Bonno, Erika B. Hess, Masha Vlasova, and FOA staff.\r\n\r\nVolume 9 will be printed in hardback on premium color paper and are available online through booksellers like Amazon, Barnes and Noble, and are available in catalogs for libraries and bookstore distribution.\r\n\r\nDetails of the Volume 9 Open Call:\r\n\r\nWinners Receive\r\n\r\n3 works published in Volume 9, complimentary digital copy of publication, social media post of work, Discounts on publications for family and friends, and free digital access to future publications\r\n\r\nSubmission Fee\r\n\r\n$25 for 5 Images\r\n\r\nDeadline\r\n\r\nMarch 8, 2019 (midnight, CST)\r\n\r\nEligible Artists\r\n\r\nArtists of all academic disciples are welcome to apply. This includes painting, sculpture, photography, installation, new media, and performance art. Please do not submit videos since we are unable to publish.\r\n\r\nGuest Jurors\r\n\r\nAlice Bonnot\r\nErika B. Hess\r\nMasha Vlasova\r\n\r\nAlice Bonnot is an independent curator and art consultant based in London. She is the co-founding director of Picnic, a contemporary art space occupying a long window in the Aylesham Centre in Peckham, London, and the founding director of the Zone d’Utopie Temporaire (Z.U.T.) residency programme, a nomadic annual residency addressing the notion of Utopia as a vehicle for artistic and critical comment. With this residency she curated exhibitions and events in Paris, London, Athens and Lisbon.  \r\n\r\nAs an independent curator Alice organised a broad range of exhibitions for galleries, institutions and artist-run spaces. Her current exhibition Hyper Mesh(18 Jan – 23 Feb 2019) at Assembly Point, London, is an exhibition that brings together new work from eight international artists; Jonathan Baldock, Pauline Bastard, fleuryfontaine, Holly Hendry, Jessie Makinson, Morgan Wills and Fani Parali. The exhibition explores contemporary notions of identity, and sets out to examine how identity structures could be re-imagined or reconstructed. \r\n\r\nPrevious exhibitions include:\u2028Engine, Picnic, London, 2018,Bored but secured, Wozen, Lisbon, 2018, \u2028Acts of disruption, The Concept Space, London, 2018,\u2028A series of pocket Utopias, Yellow Brick and Snehta, Athens, 2017, Right Through You, The Koppel Project Hive, London, 2017,\u2028Le corps comme activateur d’art numérique, Le Carreau du Temple, Paris, 2015,\u2028Prix Canson finalists, Palais de Tokyo, Paris / co-curated with Mr Laurent Boudier, 2015. \r\n\r\nErika B Hess  is a painter based in Columbus, OH recognized for her use and interest in color. Hess’s work has been exhibited nationally including Prince Street Gallery in NYC, Last Projects in Los Angles, CA, and Boston Center for the Arts in Boston, MA. In 2017, she had two solo exhibitions, “The Line Between the Past and the Present,” at the Musa Collective, Allston MA and “Viewing Light,” at Newton Free Library, Newton, MA. Her work has been featured in various publications including, Poets and Artists, Fresh Paint, Charles River Journal and Post Industrial Complex, a book released by the Museum of Contemporary Art Detroit. Her work was selected by John Seed to be featured in, “Fifty Memorable Artists 2015”. She has served on panels such as Cleveland Institute of Art’s, “Feminism Now: Exposing the Truth”, was a visiting juror for Dayton Visual Art Center’s 2016-2018 biennial, and is a recurring juror for the Walker Art MFA Prize at Boston University. Hess is a co-founder of Musa Collective, an artist collective in Boston and is the creator of I Like Your Work podcast, a podcast dedicated to interviewing artists, curators and collectors. Hess received her MFA from Boston University.  \r\n\r\nMasha Vlasova is an interdisciplinary artist, filmmaker, and educator. She holds a BFA from the Cooper Union and an MFA from Yale School of Art. She is a recipient the Fulbright Fellowship in Filmmaking, Alice Kimball Fellowship and the JUNCTURE Art and Human Rights Fellowship at Yale Law School. Her works have been exhibited and screened at Smack Mellon, Anthology Archives, and Abrons Arts Center in New York, Vox Populi and Temple University in Philadelphia, Carpenter Centerfor the Visual Artsat Harvard University among others. Her latest curatorial project “Women Filmmakers at the Intersection of Documentary, Video Art, and Avant Garde,” premiered at Indiana University Cinema in Bloomington, IN Fall of 2018. Her forthcoming essay about monument rotation will be published in a collection titled Monument Culture: International Perspectives on the Future of Monuments in a Changing World by the American Association for State and Local History/Rowman & Littlefield.", "timestamp": "2019-01-30 09:36:47"}, "6": {"ID": "bb01dc28-5d8d-496a-a270-db1bf2019ca9", "url": "https://www.nyfa.org/Opportunities/Show/bb01dc28-5d8d-496a-a270-db1bf2019ca9", "Title": "Cortex Garage Artwork", "Organization": "Cortex Innovation Community", "Website": "https://cortexstl.com/call-for-artists-cortex-garage-artwork/", "Country": "United States", "Location": "St. Louis , MO", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": " ", "Application Deadline": "02/28/2019", "Application Instructions": "TO SUBMIT\r\nTo apply, go online to the CaFÉ homepage at www.CallForEntry.org and create a free artist account. CaFÉ is free to use and there is no entry fee for this call.  Under “Find Calls” search for “Cortex Garage Artwork.” Follow the instructions for submission, upload the required images and files, and submit. For technical questions about CaFÉ, please click on “Help” on the CaFÉ website.   \r\n\r\nYou will be required to submit the following:\r\n•\tA brief letter describing your interest in the project, an explanation of why you are right for this project and confirmation of your ability to meet the project timeline. \r\n•\tA CV/resume \r\n•\tContact information for 3-5 references.\r\n•\tUp to 10 jpeg images of previously completed projects that show your experience with art projects of this scale. \r\n****PLEASE DO NOT SEND SPECIFIC PROPOSALS AT THIS TIME.\r\n\r\nQUESTIONS\r\nInterested artists may submit questions about this call by 4:00 p.m. CST on February 18, 2019 to Angie Villa at villa at viapartnership.com. Responses to questions will be posted at https://cortexstl.com/ by 4:00 p.m. CST on February 20, 2019.", "Description": "Cortex is interested in commissioning an artist to create an iconic artwork for an important and visible new parking facility in the Cortex Innovation Community in St. Louis, Missouri. This new, site- specific exterior mural or graphic treatment will embrace creative design solutions and reflect Cortex’s spirit of energy, innovation and community collaboration.\r\n\r\nCortex is working with Via Partnership to help manage the selection process which is open to artists and designers with the capacity to successfully complete design and installation/fabrication of the project within the timeline.  \r\n\r\nABOUT THE CORTEX INNOVATION COMMUNITY\r\nThe Cortex Innovation Community is a vibrant 200-acre innovation hub and technology district in the heart of St. Louis City. It sits between St. Louis’ Central West End and Forest Park Southeast neighborhoods and is surrounded by nationally ranked universities and medical centers, cultural assets, historic neighborhoods, and public spaces, including the Grand Center Arts District, Forest Park, and the Grove. The complete Cortex development plan includes support for $2.3 billion of development: 4.5 million square feet of mixed-use buildings (research, office, clinical, residential, hotel, and retail), as well as a MetroLink light-rail station, a publicly-accessible park, and 15,000 permanent technology-related jobs for the St. Louis region. Currently, over 390 companies call the Cortex Innovation Community home. The Community is an open place for big thinkers and risk takers, home to tech startups, manufacturers, corporate research and development teams, nonprofit organizations, and local restaurants, as well as entrepreneurs, artists, designers, side-hustlers, researchers, chefs, and students -- anyone who wants to build a product, grow a business, throw a party, or make connections.\r\n\r\nABOUT CORTEX\r\nCortex is a 501(c)3 nonprofit organization that oversees development of the Cortex Innovation Community, founded by Washington University in St. Louis, Saint Louis University, University of Missouri - St. Louis, BJC Healthcare, and the Missouri Botanical Garden. Cortex staff and leadership are committed to creating a community in which everyone has access to office space, capital investment, business education, mentoring, and community events. We are building a dynamic, 24/7 neighborhood of restaurants, nightlife, shops green spaces, and apartments. Cortex is committed to fostering an innovation community in which the benefits of new company formation, capital investment, job creation and wealth generation extend to all. We work closely with our District innovation centers, founding partners, and other entrepreneur support organizations across the region to create and strengthen that community. We recognize that we are part of a larger movement for inclusive economic transformation of the St. Louis region. \r\n\r\nART PROJECT DESCRIPTION\r\nThe Cortex Parking Garage is currently under construction. It is located in the center of the Cortex Innovation Community to the east of the 4220 Duncan building. The south façade of the garage will face the future Chouteau Greenway urban trail and a recently opened MetroLink light rail station. \r\n\r\nPhase 1 of the garage will have five levels made up of three bays that together are 179 feet long. The construction of Phase 1 is scheduled to be completed in May 2019. A future expansion of the garage to the east would add another two to three bays and five to six levels. While the artwork installation for Phase 2 of the garage will not occur within the current timeline, finalists will create a design for both portions of the structure, as explained below. \r\n\r\nThe new artwork on the south façade of the parking garage will be viewed by those entering and exiting the garage and will be highly visible to both MetroLink riders and passersby on the Chouteau Greenway. The artwork will also be visible to pedestrians and drivers from many other vantage points throughout the area and from nearby structures. \r\n\r\nThe artwork should make use of the design of the structure in creating a site-specific piece. Proposals are not requested at this time, but finalists selected to develop a proposal will need to work within the technical constraints of the garage design, phased construction schedule and consideration of additional areas of the garage in their design. Detailed information will be shared with finalists to include the following considerations:\r\n•\tCompleted artwork should be permanent or semi-permanent with a minimum longevity of ten years. \r\n•\tMinimal additional weight can be added to the structure of the garage and the artwork must not hinder air flow through garage openings. A painted mural, graphic treatment, or lightweight attachments to the garage face would be possible. Electricity can be made available. Finalists will be free to explore creative solutions in their concept proposals within the technical constraints. \r\n•\tFinalists’ concept proposals will address both Phase 1 and Phase 2 of the garage construction. Because the Phase 1 artwork will be completed before the construction of Phase 2, the first phase of artwork must be both independent and complementary with the design of Phase 2.\r\n•\tFinalists have the option to include the south stair concrete element in the scope of their design. The selected artist will also be consulted in selecting a complimentary color treatment for the west façade and northwest stair concrete element and elevator shaft.\r\n\r\nART PROJECT GOALS\r\nThe project should achieve the following goals:\r\n•\tBuild on the image of Cortex as a premier national and international innovation hub.\r\n•\tReflect the spirit of the cutting edge, vibrant and energetic Cortex community. \r\n•\tServe as a gateway and point of arrival into Cortex.\r\n•\tCreate an iconic point of interest to bring attention to Cortex and help spread Cortex’s message.\r\n•\tUse a functional parking infrastructure in a creative, innovative way. \r\n•\tHighlight the interplay of movement seen from the MetroLink and the Chouteau Greenway to emphasize energy and activity.\r\n•\tAs one of the first major public art commissions in Cortex, set a high bar that energizes the community to use public art in future developments and public spaces.   \r\n\r\nARTIST SELECTION PROCESS\r\n•\tArtist submissions will be reviewed by an Artist Selection Panel (ASP), made up of regional curators, arts leadership and design professionals from the St. Louis community, as well as Cortex stakeholders. \r\n•\tThe ASP will select up to three (3) finalists to develop and present concept proposals. \r\n•\tFinalists will receive a stipend of $5000 to participate in the concept proposal process, which will include touring Cortex and meeting community members prior to developing a proposal, and to present their proposal. Proposals will include renderings and a short narrative description addressing both Phase 1 and Phase 2, as well as a preliminary budget and timeline for completing Phase 1. \r\n•\tFinalists will return to St. Louis to present their concept proposals directly to the ASP in person and to present their design at a Venture Café Gathering, which is open to the public. Feedback from attendees of this presentation will be shared with the ASP.  The ASP will recommend a final artist/design for the project. \r\n•\tArtists living more than 100 miles from Cortex will be paid an additional amount up to $2000 for travel and lodging expenses in St. Louis for visits during the selection process, including the finalists’ introduction to Cortex and the presentations of the concept proposal.\r\n\r\nFINALIST SELECTION CRITERIA\r\nThe following criteria will be used by the Artist Selection Panel to select up to three (3) finalists.\r\n•\tArtistic excellence as demonstrated by past work and submitted materials.\r\n•\tA clear understanding of the project.\r\n•\tA body of work that demonstrates an ability to create an artwork that responds to the goals of the project.\r\n•\tAvailability to meet the project timeline.\r\n•\tExperience executing projects of similar scale and budget.  (If you do not feel like you meet this criteria, please include the reasons why you are right for this project in your letter of interest.)\r\n\r\nSELECTED ARTIST’S ANTICIPATED SCOPE OF WORK\r\nThe selected artist’s responsibilities will be to:\r\n•\tWork with the project art consultant, garage architects, contractors and production company (if applicable) to finalize the design for both Phase 1 and Phase 2.\r\n•\tWork with the project art consultant to coordinate fabrication (if applicable), installation and complete execution of artwork. If the selected artist fabricates and installs the artwork themselves, the selected artist will be responsible for bringing all required materials needed for installation, including approved scaffolding and equipment to be able to safely reach the facade, assistants to complete the process in the agreed-upon timeframe, painting supplies and liability insurance coverage.\r\n•\tRecommend a color treatment for the west façade, and northwest stair concrete element and elevator shaft, and, if not included in scope of design, the south stair concrete element to coordinate with the artist’s design.\r\n•\tProvide maintenance and conservation instructions for the completed artwork.\r\n•\tWork cooperatively and maintain effective communication with all parties involved in the project.\r\n•\tCollaborate with Cortex Innovation Community on marketing and promotion of artwork.  \r\n\r\nBUDGET\r\nThe budget for the artwork is not to exceed $250,000. This budget includes all costs of designing, fabricating and installing the artwork, including but not limited to all design fees, fabrication, materials and equipment costs, professional fees, travel and lodging during fabrication and/or installation, insurance, overhead, design, fabrication, site-work, shipping, and installation costs.\r\n\r\nTENTATIVE TIMELINE\r\nFebruary 18, 2019\tLast day to submit questions\r\nFebruary 28, 2019\tCall for Artists Submissions due\r\nMid-March, 2019\tUp to three (3) finalist artists selected and notified\r\nLate March, 2019\tFinalists invited for tour and introduction to the Cortex community\r\nMay 30, 2019\tFinalists present final concept proposals to ASP \r\nMay 30, 2019\tFinalists present final concept proposals at Venture Café Gathering series \r\nJune 2019\tArtist selection finalized\r\nJuly 2019\tSelected artist submits final design for approval\r\nJuly-November 2019\tFabrication (if applicable) and installation", "timestamp": "2019-01-30 09:36:47"}, "7": {"ID": "e47c593b-a393-4c41-988e-5ca9f0bfc0ac", "url": "https://www.nyfa.org/Opportunities/Show/e47c593b-a393-4c41-988e-5ca9f0bfc0ac", "Title": "Northern Regional Recreation Center – Lighting Installation", "Organization": "Arts and Science Council", "Website": "http://www.artsandscience.org/resources-for/artists/calls-to-artists/", "Country": "United States", "Location": "Charlotte, NC", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": " ", "Application Deadline": "02/15/2019", "Application Instructions": "To view/begin the application, go to https://asc.slideroom.com and sign up for an account. Applications must be received via SlideRoom by 11:59 p.m. Eastern Savings Time on February 15, 2019. There is no application fee to apply or use the SlideRoom online application system. The following materials will be required to be uploaded to SlideRoom:\r\n- Credentials: Resume or Curriculum Vitae (CV)demonstrating professional history and skills or experience as a professional artist (maximum two pages)\r\n- Statement of Interest: a brief introductory narrative that also provides insight about your interest in the project\r\n- Images: up to eight (8) images or three (3) digital video or movie files limited to two minutes each – of recent work completed within the past five (5) years\r\n- Annotation: titles, date, media and dimensions of artwork", "Description": "The Arts & Science Council (ASC) is accepting qualifications from professional artists or teams of artists in response to a public art opportunity for Mecklenburg County’s Northern Regional Recreation Center. ASC is seeking artists or teams of artists with a demonstrated record of integrating dynamic lighting into architectural space, while responding to infrastructure and community input.\r\n\r\nThe selected artist/s will be asked to create an artwork that can interact and activate specific architectural features through integrated lighting and pattern. The “silo”, a 30’ OD perforated metal cladding housing indoor water slides, highlighted in accompanying renderings has been identified as the main artwork site. Further opportunities identified by the selected artist will be considered. The lighting for the artwork can be colorful, programmable, and interactive, and should respond to the design of the silo and water slides it houses. Artists are also encouraged to consider the relationship to the integrated lighting and the perforated cladding. Specific sections of the silo’s metal cladding could be customized to interact with and enhance the experience of the integrated lighting.", "timestamp": "2019-01-30 09:36:47"}, "8": {"ID": "777196fe-5d59-4c0a-b2b3-395a98525af5", "url": "https://www.nyfa.org/Opportunities/Show/777196fe-5d59-4c0a-b2b3-395a98525af5", "Title": "Open Call to Artists", "Organization": "Openings Artist Collective", "Website": "http://www.openingsny.com", "Country": "United States", "Location": "New York, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": " ", "Application Deadline": "03/03/2019", "Application Instructions": "Submission Guidelines:\r\nArtists are asked to submit the following materials:\r\n \r\n•     Detailed Visual Proposal for The Lovely Wild, which includes clear and descriptive \r\n      text/drawings/sketches/schematics of a proposed artwork for the exhibition or images of finished \r\n      artwork that you are proposing to show. Artists are encouraged to visit the exhibition space within the \r\n      Church of St. Paul the Apostle in advance of sending their proposal.\r\n•     Proposal Statement of 250 words or less (only in .doc or .docx format) describing the proposed \r\n      artwork and how it addresses the theme. No .pdf please.\r\n•     Contact Information: name, address, email, telephone, website URL (only in .doc or .docx format).\r\n•    10 separate jpeg images of recent work (no greater than 800 pixels or 11 inches at 72 dpi). Each file \r\n      must be labeled with title, medium, dimensions and artist’s name.\r\n•     Current CV (only in .doc or .docx format).\r\n•     Artist Statement of 250 words or less (only in .doc or .docx format).\r\n \r\nSubmissions that do not follow requested formats will not be accepted.\r\n\r\nEligibility:\r\nThis call for entries is open to any visual artist over the age of 18. All submissions must be received via email to mail@openingsny.com There is no fee for submitting a proposal; however, we will ask accepted artists to consider submitting a voluntary $25.00 donation. This donation will go towards the cost of promotion, hanging, publicity, and opening reception. Please note that no one has ever been turned away for inability to afford this donation. Artists will be selected by a jury of current Openings members and invited guest jurors from the field. In addition, selected artists are required to sign an exhibition contract and to comply with the terms therein. A release of liability form is also required. Failure to do so will result in disqualification.  \r\nPublic contact:  mail@openingsny.com", "Description": "The Openings Collective announces an open call for the group exhibition, \"The Lovely Wild.\" \r\nLooking out into a wilderness, not knowing where you are headed, where we are headed.    Artists, if they are to be artists,  must go into that wilderness and have conversations, conversations where all involved are changed such that the wilderness is no longer fearful but hopeful; not a place of terror, but one of peace.    \r\n\r\n Artists are asked to submit a detailed proposal for artwork in any medium which explores their interpretation of this theme, addressed either personally, publicly, politically, aesthetically, conceptually, or spiritually. Artwork will be exhibited within the unique space of the interior of the Church of St. Paul the Apostle on the corner of Columbus Avenue and W. 60th Street in New York City.", "timestamp": "2019-01-30 09:36:48"}, "9": {"ID": "853b22e8-17d6-4525-8ba8-c70974c17aa0", "url": "https://www.nyfa.org/Opportunities/Show/853b22e8-17d6-4525-8ba8-c70974c17aa0", "Title": "Open Call: 2019 Public Artists in Residence with the City of New York", "Organization": "New York City Department of Cultural Affairs", "Website": "http://www1.nyc.gov/site/dcla/publicart/pair.page", "Country": "United States", "Location": "New York, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Disciplines", "Application Fee": " ", "Application Deadline": "02/24/2019", "Application Instructions": "https://nyculture.submittable.com/submit", "Description": "The NYC Department of Cultural Affairs (DCLA) is seeking four artists to join the Public Artists in Residence (PAIR) program in 2019: one selected artist will be placed in residence with the following City agencies and offices: the Department of Mental Health and Hygiene, Department of Aging, Department of Records and Information Services, and the Mayor’s Office of Sustainability.\r\n\r\nABOUT PAIR\r\nDCLA’s Public Artist in Residence program (PAIR) is based on the premise that artists are creative problem solvers. To that end, DCLA embeds socially engaged artists in New York City municipal agencies in order to use creative, collaborative art practice to propose and implement creative solutions to pressing civic challenges.\r\n\r\nLaunched in 2015, PAIR takes its name and inspiration from the pioneering work of artist Mierle Laderman Ukeles, the first official artist in residence with the NYC Department of Sanitation (1977- present).  Since establishing the program, DCLA has embedded 10 artists in 8 agencies, including Tania Bruguera at the Mayor’s Office of Immigrant Affairs, The Lost Collective at the Administration for Children’s Services, Tatyana Fazlalizadeh at the Commission on Human Rights, among others. For a full list of PAIRs to date, click here.  \r\n\r\nAll of the PAIR partnerships – some of which are still ongoing – vary greatly in concept, scope, duration, and populations engaged, and their successes are driven by the openness of the partner agencies and the artist-led, collaborative process that the PAIR program framework provides. \r\n\r\nRESIDENCY STRUTURE, FEES, and MATERIALS\r\nPAIR residencies begin with a required half-day orientation session, which kicks off a three-month Research Phase.  This Phase is a time for the artist and agency to establish mutual trust through shared exposure to each other’s work and process—the artist shadows agency staff and attends meetings, trainings and site visits, and in turn the agency hosts an artist talk and visits the artist at their studio.  \r\n\r\nThe Research Phase ends with the artist proposing a project, designed in collaboration with the partner agency, to produce during the remaining eight months of the residency.  The Implementation Phase of the residency is marked by approval of the project proposal and initiation of the work.  The proposed project must be collaborative in nature and include at least one (1) public-facing event or component. Both DCLA and the partner agency will continue to provide the artist support during the project’s production for the duration of the residency.  \r\n\r\nThroughout the residency, the artist and agencies have weekly check-ins by phone or in-person to assist in project production.\r\n\r\nPAIR funding per residency is $40,000: $20,000 for the Research Phase and $20,000 for the Implementation Phase. Funding is inclusive of related project expenses (e.g., printing, materials, equipment, video production, etc.). The selected artist(s) are responsible for managing the project budget and submitting invoices. No additional funding is provided.", "timestamp": "2019-01-30 09:36:48"}, "10": {"ID": "86bca55b-2114-4992-824d-6266dac16c79", "url": "https://www.nyfa.org/Opportunities/Show/86bca55b-2114-4992-824d-6266dac16c79", "Title": "Upcycle Junction Market: Open Call for Vendors", "Organization": "The Junction BID", "Website": "www.exploreflatbush.com", "Country": "United States", "Location": "Brooklyn, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "Crafts", "Application Fee": " ", "Application Deadline": "01/31/2019", "Application Instructions": "https://thejunctionbid.submittable.com/submit/130103/upcycle-junction-market-open-call-for-vendors", "Description": "We are looking for Brooklyn Based artists who specialize in  jewelry, painting, sculpture ,textiles and wood and are interested in being a street vendor and to develop their own brand.\r\n\r\nRequirement: portfolio and online presence.\r\n\r\nThe Upcycle Junction Market is an entrepreneural initiative of the Flatbush Junction BID. It is targeted at creatives in the art and design field, who work with recycled and salvaged materials. The program includes hands on training in product design, branding, pricing and marketing. Candidates who complete the training will participate in the Upcycle Junction Market on Hillel Plaza in May 2019.", "timestamp": "2019-01-30 09:36:48"}, "11": {"ID": "381c9594-2e6b-42dc-98b1-295e7287cf0c", "url": "https://www.nyfa.org/Opportunities/Show/381c9594-2e6b-42dc-98b1-295e7287cf0c", "Title": "ROLLING SUBMISSIONS: Superfine! Art Fair | New York 2019", "Organization": "Superfine! Art Fair", "Website": "http://www.superfine.world/exhibit-nyc", "Country": "United States", "Location": "New York, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$40.00", "Application Deadline": "03/27/2019", "Application Instructions": "1. Review our floor plan and decide which available space you would like (link below).\r\n2. Fill out and submit your application (~10-15 min., link below).\r\n3. Email five high-quality artwork images to exhibit@superfine.world (these are only examples for initial promotion, you may show different/more works for the fair itself).\r\n\r\nFLOOR PLAN + EXHIBITOR INFO:\r\nhttps://superfine.world/exhibit-nyc\r\n\r\nDIRECT LINK TO APPLICATION:\r\nhttps://na3.docusign.net/Member/PowerFormSigning.aspx?PowerFormId=7ef148e8-58c5-4885-896a-a3b157674304&env=na3&v=2", "Description": "The rapidly growing art fair that has spread its \"make art yours\" mantra to Washington DC, Miami, and Los Angeles returns for the third year to its easy-to-get-to, high traffic Meatpacking location in Manhattan. Superfine! NYC '19 applications close on Wednesday, March 27th, however applications are reviewed and accepted on a rolling basis. 60% of artist booths and 30% of gallery booths are already reserved by other cutting-edge, new contemporary exhibitors, and all booths will likely be sold out before the application deadline. Here's what's still available:\r\n\r\nGALLERIES:\r\n• 18 booths in our Gallery Pavilion ranging from 16 - 32 linear feet of wall ($4,000 - $8,000)\r\n\r\nSOLO ARTISTS:\r\n• 4 Elevate Booths: 12-foot artist booths; the fair's most popular size ($3,000)\r\n• 13 Immerse Booths: 16-foot artist booths for artists wishing to have a larger footprint in the fair ($4,000)\r\n\r\nSuperfine! receives frequent and consistent media coverage in outlets like Washington Post, New York Post, and Artnet, and the fair holds the key to the growing, \"maturing\", and engaged young collector masses. About 20% of visitors make a significant purchase of at least $500, and 90% of past exhibitors report selling to almost exclusively new clients outside of their existing collector network.\r\n\r\nSuperfine! NYC will be hosted from May 1-5 on 14th Street in the Meatpacking District (at the foot of the bustling High Line Park). Superfine! is an art fair engineered for galleries who recognize a needed shift in the art market and for artists treating their talents as a serious art business.\r\n\r\n\r\nGET A BETTER SENSE OF THE FAIR:\r\nSuperfine! on Artnet: https://news.artnet.com/partner-content/superfine-la\r\nSuperfine! NY '18 Recap Video: https://youtu.be/_vyyZ8LQjOk\r\nExhibitor Testimonials: https://superfine.world/testimonials/", "timestamp": "2019-01-30 09:36:48"}, "12": {"ID": "24d458ab-f686-4590-8580-8db43f5a9fe2", "url": "https://www.nyfa.org/Opportunities/Show/24d458ab-f686-4590-8580-8db43f5a9fe2", "Title": "LAST WEEK TO APPLY: Superfine! Art Fair | Los Angeles 2019", "Organization": "Superfine! Art Fair", "Website": "http://www.superfine.world/exhibit-la", "Country": "United States", "Location": "Los Angeles, CA", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$40.00", "Application Deadline": "01/25/2019", "Application Instructions": "1. Review our floor plan and decide which available space you would like (link below).\r\n2. Fill out and submit your application (~10-15 min., link below).\r\n3. Email five high-quality artwork images to exhibit@superfine.world (these are only examples for initial promotion, you may show different/more works for the fair itself).\r\n\r\nFLOOR PLAN + EXHIBITOR INFO:\r\nhttps://superfine.world/exhibit-la\r\n\r\nDIRECT LINK TO APPLICATION:\r\nhttps://na3.docusign.net/Member/PowerFormSigning.aspx?PowerFormId=04ccfe1f-218a-4fee-8b47-af2ce43ec25a", "Description": "The rapidly growing art fair takes its tried and true yet untraditional approach to the west coast for the first time next month after reinvigorating the New York, Miami, and Washington DC art markets. Superfine! LA '19 applications officially close this Friday, January 25th, and there are still a small handful of gallery and solo artist booths up for grabs. Here's what's still available:\r\n\r\nGALLERIES:\r\n• SIX booths in our Gallery Pavilion ranging from 16 - 32 linear feet of wall ($3,600 - $7,200)\r\n\r\nSOLO ARTISTS:\r\n• THREE Elevate/LA Booths: 12-foot artist booths dedicated to LA-based artists ($2,700)\r\n\r\nMULTIMEDIA ARTISTS, COLLECTIVES, GALLERIES, + CURATORS:\r\n• ONE A/V Room: 575 square foot room for audio, visual, VR, AR, olfactory-and-beyond projects ($3,000)\r\n\r\nSuperfine! receives frequent and consistent media coverage in outlets like Washington Post, New York Post, and Artnet, and the fair holds the key to the growing, \"maturing\", and engaged young collector masses. About 20% of visitors make a significant purchase of at least $500, and 90% of past exhibitors report selling to almost exclusively new clients outside of their existing collector network.\r\n\r\nSuperfine! LA will be hosted from February 14-17 at DTLA's familiar Magic Box convention center. Superfine! is an art fair engineered for galleries who recognize a needed shift in the art market and for artists treating their talents as a serious art business.\r\n\r\n\r\nGET A BETTER SENSE OF THE FAIR:\r\nSuperfine! LA on Artnet: https://news.artnet.com/partner-content/superfine-la\r\nSuperfine! NY '18 Recap Video: https://youtu.be/_vyyZ8LQjOk\r\nExhibitor Testimonials: https://superfine.world/testimonials/", "timestamp": "2019-01-30 09:36:48"}, "13": {"ID": "284e490c-34a7-4f22-b577-fa610bf6f0c2", "url": "https://www.nyfa.org/Opportunities/Show/284e490c-34a7-4f22-b577-fa610bf6f0c2", "Title": "Call for Work: Art Stands Still", "Organization": "Collar Works", "Website": "https://artstandsstill.wixsite.com/home", "Country": "United States", "Location": "Troy, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": " ", "Application Deadline": "03/01/2019", "Application Instructions": "Submit application to ArtStandsStill@gmail.com by Friday, March 1, 2019\r\n​\r\nSubmission Guidelines\r\no     Only one application per artist will be accepted; however, artists may submit up to three works for consideration, and up to five images of the work or one video clip per each work on the application. File formats accepted are JPEG, TIFF, PDF, and MOV. ​\r\no     Image files should be no larger than 5 MB; video clips may exceed this size requirement but should be no longer than 5 minutes in duration. \r\no     Please include your name, a brief artist statement, a description of each submitted work, a CV, and a link to your artist website.\r\n \r\nDates\r\no     Submissions due Friday, March 1, 2019. \r\no     Artists will be notified by e-mail of decisions by Sunday, March 17, 2019.\r\no     Confirmation by accepted artists and commitment to show work will be required by Friday, March 29, 2019.\r\no     Work must be received by Friday, May 10, 2019.\r\no     Work will be returned by July 20, 2019.", "Description": "Call for Work: Art Stands Still \r\nMay 31 – July 13, 2019\r\n​\r\nIn the United States, freedom has historically been linked to the right to move as one pleases.  This limited understanding of freedom has led to the creation of a system that constrains the movement of the many to reinforce the supposed freedom of the few. Policies of containment can be found throughout the history of the United States: Japanese internment camps, Native American reservation systems, the Chinese Exclusion Act, and Jim Crow segregation, not to mention today’s mass incarceration of people of color, the travel ban blocking entry to those from majority-Muslim nations, and the shutdown of the government over the funding of a border wall between the United States and Mexico.  \r\n​\r\nIn our modern history of art, freedom has also been conceptualized as movement: the avant-garde push our society forward through their new and unconventional choices.  Like the first line of an army charging into battle, these artists attempt novel works of art while denying any previous influences or collaborators. This concept of freedom has restricted our understanding of what artistic genius looks like to the domain of white men, who, as art historian Linda Nochlin famously pointed out, have suffered from less societal restrictions to their claims of independence and exceptionality. \r\n \r\nContemporary artists and historians working in disability studies, gender studies, critical race theory, and queer theory, among other fields, have begun the important work of dismantling the conflation of freedom with movement.  How does our current limited definition of freedom support hegemonic capitalist, nationalist, sexist, racist, ablest, homophobic, transphobic systems of power in the art world and beyond? How can we visualize alternative notions of freedom through art? How can mobility participate in the limitation or denial of such freedoms? And what happens when artists and viewers not only resist moving forward, but choose to stand shockingly still? \r\n \r\nThe group exhibition, Art Stands Still, will open at Collar Works, a repurposed textile factory, within Troy, New York, a city that was once celebrated for its position at the forefront of American industrial achievement. Like many Rust Belt economies, it experienced a sharp economic decline in the late twentieth century. What is forward for cities like Troy? Art Stands Still looks to create a place for a community of alternatives to spatial, temporal, and social advancement.  Works may be connected to the theme broadly and all media will be considered.\r\n \r\nJust for a moment, let’s not go anywhere, together.", "timestamp": "2019-01-30 09:36:48"}, "14": {"ID": "33f6d3c5-f2b8-4ffb-bbb4-9b4c573c1432", "url": "https://www.nyfa.org/Opportunities/Show/33f6d3c5-f2b8-4ffb-bbb4-9b4c573c1432", "Title": "Fashion Week NY- Call  to ARTISTS/SCULPTORS/PHOTOGRAPHERS-  NYC FASHION WEEK!", "Organization": "Six Summit Gallery", "Website": "http://www.sixsummitgallery.com", "Country": "United States", "Location": "New York, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Disciplines", "Application Fee": "$35.00", "Application Deadline": "02/04/2019", "Application Instructions": "Global Juried Show by Six Summit Gallery\r\n\r\nCall to ARTISTS\r\nEMAIL SUBMISSIONS ONLY TO\r\nfashion@sixsummitgallery.com\r\n\r\nELIGIBLE WORK: Paintings, Photos works in all media.This show is open to all artists regardless of place of residence however you must deliver in person and you may be responsible for hanging.  (ceilings are high/see floorplan or google Angel Orensanz Foundation. All work must be wired and ready to hang. SUBMISSIONS: All work will be judged by email entry via fashion@sixsummitgallery.com. You MUST write [YOUR NAME]” IN THE SUBJECT OF EMAIL. YOUR NAME MUST BE THE SAME ON YOUR CREDIT/DEBIT CARD Example: Subject: FASHION SUBMISSION: John Doe. Files must be in .jpg format, 300 dpi, max 900 pixels in any dimension. File name should correspond to the title of the piece. PUT title, medium, artist, price, and size as JPEG FILE EXTENSION NAME.!  No accepted work may be removed prior to the show’s conclusion (unless of course it is sold) ALL work must be for sale. You may use existing hooks and existing metal pole on ceiling which goes around perimeter  (we have the wires) You may not make holes n walls. Sculptors must bring their own pedestals or free standing is ok. You are required to make your own labels. They must include Title, Medium,Price, and Your Name, www.sixsummitgallery.com – with “Purchase or Inquire Now” “Call or text Leo 917-573-0029” clearly visible on the bottom below www.sixsummitgallery.com. Purchases will take place during the show- Customers can leave with art or we can help arrange delivery.\r\n\r\nNote: The Show Committee reserves the right to disallow the exhibition of any work which, in the opinion of the Committee, is considered detrimental to the good public image of the show and its sponsors, which is too fragile to handle, or which is not accurately represented by the photo submitted. Six Summit Gallery, Angel Orensanz, or Art Hearts Fashion its officers or agents are NOT responsible for loss or damage or theft of any. We reserve the right to photograph work or use submitted images for publicity. ENTRY FEES: $75 for up to 6 entries. $35 for up to 2 entries.  Only work submitted with fee will be considered. Easily click on www.sixsummitgallery.com online store and go to ONLINE STORE-EVENTS SUBMISSION  https://sixsummitgallery.com/products/event-submissions-products \r\nand choose $35 or $75.- Please call the Gallery for any special situations.\r\nArtist receives 60% on accepted sold work.\r\n\r\nWe are a fully insured gallery and represent this is a normal course of business. Six Summit Gallery and partners are not responsible for theft or damage of art. Admission will be made available to artists and guests!\r\nThis show and venue is the highlight of NYFW. We expect active participating artists for this show. \r\n\r\nQUESTIONS CAN BE EMAILED ONLY TO: Fashion@sixsummitgallery.com Include your Call Back Number!\r\nDO NOT CALL OR EMAIL ANGEL ORENSANZ OR ART HEARTS\r\n(DATES and TIMES Subject to Change)\r\n\r\nDelivery – February 8th,  9AM-NOON (you can stay and hang art or drop off only if pre arranged)\r\nPick up – Feb 11th  after last show OR Feb 12th 9-10:30AM\r\n\r\nShow dates and times- announced on our website www.sixsummitgallery.com (click on Art Hearts Fashion link)", "Description": "This is the largest fine art and fashion platform in NYC, LA and Miami.\r\n\r\n172 Norfolk St (lower east side) Angel Orensanz Gothic Cathedral\r\nNew York, NY 10002\r\n917-573-0029\r\nwww.sixsummitgallery.com\r\n\r\nFashion Week: Angel Orensanz Center – Contemporary Art and Gothic Revival for “Art Hearts Fashion”\r\n\r\nSix Summit Gallery is a leading multi-platform fine art and entertainment concern.  Art Hearts Fashion is a leading large award winning internationally known exquisite haute couture inclusive fashion platform whose designers dress some of the worlds most notable people. \r\n\r\nOver 18  Shows- Thousands expected. Accepted artists will receive complimentary ticket for every show and discount for friends. \r\n\r\n– One of the true extraordinary venues in NYC. Over 30,000 square feet, multiple levels.\r\n\r\nArt does not have to be directly fashion related.\r\nSix Summit Gallery curates New York Fashion Week\r\nwith Art Hearts Fashion.\r\nArt Hearts Fashion” events are a leading platform for artistically inspired emerging, celebrity and couture designers to showcase their collections in a contemporary fashion week setting. AHF events have been held coast to coast as a national showcase for designers to participate in New York, Miami, Mercedes-Benz Fashion Week China and Los Angeles Fashion Week. Founded by Philanthropist and Designer Erik Rosete, Participating designers can be seen on every major Hollywood celebrity including: Beyoncé, Lady Gaga, Katy Perry, Nicki Minaj, Rita Ora, Jennifer Lopez, Shakira, Miley Cyrus, Carrie Underwood, and countless more. The platform is unequivocally intertwined with the causes and organizations it supports.\r\n\r\nArt Hearts Fashion to Break New Ground during NYFW with over 20 Designers at the Angel Orensanz Foundation\r\n(New York, New York)—Revolutionary bi-coastal fashion platform Art Hearts Fashion hosts New York Fashion Week Feb 8-11th at the Neo-Gothic NYC landmark, the Angel Orensanz Foundation on the culturally flourishing lower east side. The Angel Orensanz Foundation, a replica of the Sistine Chapel in Rome, has long been the home for artistic and performing arts. The Cathedral will serve as the dramatic setting for NYC’s most highly attended shows this season of Art Hearts Fashion. A favorite among press and celebrities alike, this season Art Hearts Fashion brings an impressive lineup of over 20 acclaimed designers to the catwalk during 4 full days of runway shows and exclusive closing gala.\r\n\r\nGlobal Juried Show by Six Summit Gallery", "timestamp": "2019-01-30 09:36:48"}, "15": {"ID": "a4188d07-630e-4d77-8581-7be610c892a6", "url": "https://www.nyfa.org/Opportunities/Show/a4188d07-630e-4d77-8581-7be610c892a6", "Title": "Free Open Call &#39;RECYCLING IS CULTURE&#39;", "Organization": "KENEKTID Inc.", "Website": "http://www.kenektid.us/xearth", "Country": "United States", "Location": "New York, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": " ", "Application Deadline": "02/18/2019", "Application Instructions": "www.kenektid.us/xearth\r\nwww.kenektid.us/instruction\r\nContact: xgallery@kenektid.us", "Description": "New York's creative collaboration project agency, Kenektid Inc. challenges to spark new creative projects to recreate our culture that cares humanity and our only home, the Earth.\r\n\r\nAs the first project, we started an environmental art campaign 'Recycling Is Culture' in New York City. We support one of NYC's mission 'Zero waste to landfill 2020' and this campaign is about showing art pieces to public with the information of what to recycle in NYC.\r\n\r\nWe opened the Instagram page 'Recycling is culture' as an idea to contribute our talent to support the mission and also help artists and designers be inspired and showcase their works. \r\n\r\nWe believe the influence of art can help the community to lead the culture and visually emphasize the importance and the effects of recycling. We also wish this art campaign could give valuable influence to next generation.\r\n\r\nThis call is part of the art campaign and the artwork should be created by specific topic and color code.\r\n\r\nThis is an opportunity for artists to experiment with new ideas in the global issue and utilize 'Recycling Is Culture' as a valuable resource.\r\n\r\nThe works will be exhibited at our gallery space on March 2019.\r\n\r\nOur long term goal is to present the contributed artworks on the construction fences on the street as recycling the space. New York itself is already a culture, and we sincerely wish that the 'Recycling Is Culture' campaign can elevate NYC's art & culture and positively influence other cities around the globe.\r\n\r\nTopic:\r\n\r\nThe topic should include one of garbage subject and contains NYC's recycling color code; Blue(Plastic, Metal, Glass, Carton), Green(Paper), Grey scale(Landfill).\r\n\r\nTopic and color code is based on DSNY's recycle poster.\r\nPlease refer to other artists works on our website.\r\n\r\nArtists and designers can submit their works through email, and we post the submitted works to our Instagram account.\r\n\r\nYou must follow the instruction on our website.", "timestamp": "2019-01-30 09:36:48"}, "16": {"ID": "413c9d2e-3fd2-44e9-a10d-092432aa634c", "url": "https://www.nyfa.org/Opportunities/Show/413c9d2e-3fd2-44e9-a10d-092432aa634c", "Title": "The 3rd Art Olympia International Open Art Competition", "Organization": "Art Olympia Executive Committee Office", "Website": "http://artolympia.info", "Country": "N/A", "Location": " ", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$60.00", "Application Deadline": "03/15/2019", "Application Instructions": "[Entrysite] \r\nhttp://www.juriedartservices.com/index.php?content=event_info&event_id=1452\r\n\r\n[Entry Rules and Regulations]\r\nTwo-dimensional works, representational or abstract; oil,\r\nacrylic, watercolor, pastel, mineral pigments, print, charcoal, digital/multimedia art, mixed media, photography etc. (calligraphy, video,  sculpture,  and  group/collaboration  works  are  not  accepted) \r\nOriginal works that have never been previously submitted to other competitions (rule offender will be revoked)\r\nSize and weight\r\nMaximum Size: 117cm x 117cm (46 x 46 inch)\r\nMaximum Depth: 10cm (4 inch) (including the frame)\r\nMaximum weight: 20kg (44.1lbs)\r\n\r\n[Entry Period]\r\nEntry Period: September 15, 2018 – March 15, 2019\r\n\r\n[Eligibility]\r\nRegardless of nationality, you must be a resident outside of Japan and the age of 18 or older for New York entries.\r\nCategories:\r\n- All-Entrants Category: All entrants\r\n- Student Category: Entrants who are enrolled in a university, graduate school, technical school or similar and less than 35 years old at the time of entry.\r\n*Student artists are simultaneously registered in the All-Entrants\r\nCategory when they enter the Student Category.\r\n\r\n[Entry Fee and Payment]\r\nGeneral submission: \r\n$60 for 1 image, $100 for 2 images, $140 for 3 images\r\nStudent submission:\r\n$40 for 1 image, $70 for 2 images, $100 for 3 images\r\n*Student ID will be required for the Student Category prior to the final review.\r\n*Each artist is limited to THREE images.", "Description": "Art Olympia is an open art competition held as a biennial event with the goal of discovering talented artists from around the world and supporting their art activities. Approximately 160 artworks (80 from Japan and 80 worldwide) will be selected and undergo a final review in Tokyo by a panel of esteemed judges invited from around the world. In addition, 1,000 artists will be honored.\r\n\r\n[Entry Locations]\r\nThe primary screening will be held at two locations: New York and Tokyo. There will be 80 works selected from each location, which will proceed to the final review in Tokyo. At the final review, 160 artworks will be evaluated to select the winners. The New York-based entry is for artists residing outside of Japan regardless of nationality.\r\n\r\n[Awards]\r\nThe first place winner will receive $120,000 and 1,000 artists will be featured on the Art Olympia website as well as art magazines.\r\n\r\n[Judging Process]\r\nAt the primary screening, a panel of five (5) jurors will evaluate the works as digital images in March 2019. Ten (10) jurors will conduct the final review by evaluating the actual works in Tokyo in June 2019. In order to have a fair competition, all artworks will be judged without disclosing the name of the artists. Art Olympia also adopts a clear point system for their judging. \r\n\r\n[Jurors]\r\nThe following is the list of jurors for Art Olympia 2019. Don’t miss out on this great opportunity to have these esteemed art experts look at your work!\r\nPrimary screening jurors for New York Entries \r\nBrett Littman: Director of The Noguchi Museum/New York \r\nChu Teh-I, Artist: Founder of the Kuandu Museum of Fine Arts/Taipei\r\nFlorence Derieux: Director of Exhibition at Hauser & Wirth New York/New York\r\nEmmanuelle Lequeux: Journalist for Le Monde /Paris\r\nZheng Lin: Founder and Director of Tang Contemporary Art/Beijing\r\nFinal review in Tokyo, above plus next Tokyo Jurors\r\nHiroshi Senju: Artist \r\nToyomi Hoshina: Vice President of Tokyo University of the Arts \r\nAkiya Takahashi: Director of the Mitsubishi Ichigokan Museum \r\nYuko Hasegawa: Curator at Museum of Contemporary Art Tokyo \r\nAkiko Endo: Artist", "timestamp": "2019-01-30 09:36:49"}, "17": {"ID": "592c2572-10c4-416c-9764-14eaed973a69", "url": "https://www.nyfa.org/Opportunities/Show/592c2572-10c4-416c-9764-14eaed973a69", "Title": "14C Art Fair - opportunities for artists, galleries and arts organizations", "Organization": "Jersey City Arts Council/14C Art Fair", "Website": "http://www.artfair14c.com", "Country": "United States", "Location": "Jersey City, NJ", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$35.00", "Application Deadline": "01/28/2019", "Application Instructions": "Applicants for either the exhibition rooms or the Juried show should fill out the forms available at artfair14c.com/apply\r\nJuried Show applicants must have an address in New Jersey and can submit 3 images.\r\nApplicants for an exhibition room (approx 360-400 sq ft hotel room) have no geographic restriction, but must submit representative images of the art they plan to exhibit. \r\nApplication deadline is January 28, 2019, 11:59PM ET, and the application fee is $35.\r\n\r\nThere is more information and FAQs on our website - artfair14c.com.  Or write to us at info@artfair14c.com.", "Description": "14C Art Fair is a new - and mission-driven - art fair, which is an initiative of the Jersey City Arts Council, a 501c3 non-profit.\r\n\r\nRecognizing that art fairs can be out of reach for small and medium sized galleries, as well as visual arts organizations, 14C Art Fair offers artists and galleries the opportunity to participate at cost.  \r\n\r\nHeld from March 15-17, 2019 on three floors of the Hyatt Regency Exchange Place on the Jersey City waterfront, with abundant mass transit and parking options, exhibition rooms are available for $249/night.  Galleries, arts organizations and individual artists are all welcome to apply for exhibition rooms.  \r\n\r\nThere is also a Juried Show that is restricted to artists who live or work in New Jersey, which will be on display in the Penthouse ballroom of the Hyatt.\r\n\r\nMore information, and FAQs, on our website - artfair14c.com\r\n\r\nApplications deadline is January 28, 2019.", "timestamp": "2019-01-30 09:36:49"}, "18": {"ID": "091cbba5-9874-4945-b65b-48711c7a32ef", "url": "https://www.nyfa.org/Opportunities/Show/091cbba5-9874-4945-b65b-48711c7a32ef", "Title": "OyG Projects: Open Call for Two Solo Exhibitions", "Organization": "Ortega y Gasset Projects", "Website": "https://www.oygprojects.com/open-call-2019", "Country": "United States", "Location": "Brooklyn, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$25.00", "Application Deadline": "02/11/2019", "Application Instructions": "How to apply:\r\nhttps://ortegaygassetprojects.submittable.com/submit/130768/open-call-2019-two-solo-exhibitions-at-oyg-projects\r\n\r\nIMAGES:\r\n\r\n10 images of work including: title, year, media and dimensions \r\n\r\nSize requirements:  Images (up to 5MB each), Video (up to 250MB each), Audio (up to 30MB each)\r\n\r\nCV:\r\n2 pages max\r\n\r\nREFERENCES:\r\nPlease provide us with two references who can talk about your work and practice: name, title/organization, relationship, email address. We will only contact these individuals if need be.\r\n\r\nPROPOSAL:\r\nPlease describe your work and what you envision as your solo exhibition. \r\n\r\nSome things to consider: Why do you want a solo exhibition at OyG? What does this opportunity mean to you? If you're applying for the Skirt, please consider how your work will respond to/interact with the specific space.\r\n\r\n(200 words max).\r\n\r\nPlease email oygsubmissions@gmail.com if you have any questions.", "Description": "Ortega y Gasset Projects is pleased to announce an Open Call for TWO Solo Exhibitions to open in September of 2019: one in the main gallery space at OyG and one in The Skirt, OyG's dedicated space for site-specific installation.\r\n\r\nBoth opportunities will include an opening reception on Saturday, September 14, 2019, $350 honorarium for each artist/proposal, and one programmed event (an artist talk or a closing event), and will be promoted on OyG social media outlets. OyG Co-Directors will work with the artists and make studio visits leading up to the opening of the exhibitions, if possible. The artists are required to fully participate in the exhibitions' installation and deinstallation.\r\n\r\nVisual artists of all disciplines (and geographical locations) are encouraged to apply. The artists will be selected by the OyG Co-Directors based on the quality of their work and commitment to their practice. Artists are highly encouraged to specify which space they'd like to exhibit in, the main gallery space or The Skirt. The OyG Co-Directors will make the final decision.\r\n\r\nAn alternate list of candidates/runners-up will be posted on our website and considered for future programing at the gallery. Past/future exhibition artists that we discovered from our past Open Calls include: Patrice Helmar, Jihyun Hong, Familien Iglesias,  Carl E. Hazlewood, Rose Nestler, Norm Paris, Ben Pederson, Padma Rajendran, Adam Liam Rose, Winnie Sidharta and Kuldeep Singh.\r\n\r\nTo see images of the space:\r\nhttps://www.oygprojects.com/spatial-specs\r\n\r\nDates:\r\nApplication opens: January 14, 2019\r\n\r\nDeadline: Monday, February 11, 2019, midnight\r\n\r\nNotification: May 1, 2019\r\n\r\nExhibition install: August 31, 2019\r\n\r\nOpening reception: Saturday, September 14, 6:00 PM - 9:00 PM\r\n\r\nExhibition ends: October 13, 2019\r\n\r\n\r\nOrtega y Gasset Projects is an artist-run gallery founded in 2013, located within the Old American Can Factory building in the Gowanus section of Brooklyn. OACF is a 24-hour access building accessible by the D, R, N, W, F, G trains. For more information about OyG click here. \r\n\r\nOyG Co-Directors:\r\nEleanna Anagnos (Brooklyn, NY)\r\nClare Britt (Chicago, IL)\r\nCatherine Haggarty (Brooklyn, NY)\r\nEric Hibit (Queens, NY)\r\nWill Hutnick (Wassaic, NY)\r\nNickola Pottinger (Brooklyn, NY)\r\nZahar Vaks (Brooklyn, NY)\r\nLauren Whearty (Philadelphia, PA)", "timestamp": "2019-01-30 09:36:49"}, "19": {"ID": "dd04fff2-708c-4ad9-b7c5-f10f3595f46c", "url": "https://www.nyfa.org/Opportunities/Show/dd04fff2-708c-4ad9-b7c5-f10f3595f46c", "Title": "Request for Qualifications - Eight Public Art Opportunities", "Organization": "Campus Arts Initiative", "Website": "http://campusarts.psu.edu/", "Country": "United States", "Location": "University Park, PA", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": " ", "Application Deadline": "02/14/2019", "Application Instructions": "ELIGIBILITY AND CRITERIA\r\nWe are seeking visual artists or teams that include a visual artist. There are no residency requirements for this opportunity, but applicants should be aware that the program requires site visits and in-person collaboration with partners. Professional and emerging artists who are new to the field of public art and/or have experience working with students are encouraged to apply. Faculty and students of Penn State University are eligible to apply.\r\n\r\nPenn State is an equal opportunity, affirmative action employer, and is committed to providing opportunities to all qualified applicants without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. \r\n\r\nApplications will be reviewed on the following criteria:\r\n•\tAesthetic quality of previous work\r\n•\tExperience working collaboratively\r\n•\tExperience working in the public realm or with communities in interdisciplinary settings\r\n•\tQuality and completeness of application materials\r\n\r\nABOUT\r\nThe participating partner sites are:\r\n•\tCenter for Performing Arts at Penn State (University Park)\r\n•\tLGBTQA Student Resource Center (University Park)\r\n•\tPenn State Abington \r\n•\tPenn State Beaver\r\n•\tPenn State College of Engineering (University Park)\r\n•\tPenn State Erie, The Behrend College\r\n•\tPenn State Lehigh Valley\r\n•\tPenn State Materials Research Institute (University Park)\r\n\r\nThese partners will serve on the selection panel, along with representatives from Campus Arts and additional arts professionals. Once each organization is partnered with an artist, the artist will work with stakeholders at the host site to develop a proposal for the design and implementation of a temporary public art project/intervention. The resulting works will be catalysts for community and student engagement, making the arts central to the Penn State experience.\r\n\r\nTemporary artworks are expected to be present at the site, on loan, for up to one year. Please note that the purpose of this program is to provide an opportunity for partners and artists to collaborate on developing new ideas for temporary artworks. It is not a funding stream to implement existing plans or concepts for specific works of art. \r\n\r\nThe selected artists will enter into a contractual agreement with the university and their partner site. This program is supported by a grant through Penn State’s Strategic Planning Seed Grant.\r\n\r\nBUDGET\r\nEach artwork has a budget of $7,000. Artists will be asked to generate a budget within this framework that includes an artist’s fee, materials and fabrication costs, site visits, project management, and installation and de-installation of the work. Artists are required to furnish proof of general liability insurance before funds are dispersed. Projects will be considered on loan from the artist for a period of up to one year. Please note that at least two site visits (one initial visit and one during installation) are required.\r\n\r\nPartners will select artists with guidance from Campus Arts. Depending on the scale and scope of the proposed collaborations, additional resources may be sought on a case by case basis.\r\n\r\nSELECTION PROCESS\r\nCampus Arts will facilitate the artist selection process. Qualifications submitted through this RFQ will be reviewed by a selection committee. A limited number of artists will be invited for an interview. Only one artist or artist team will be chosen for each partner site.\r\n\r\nDuring the interview process, artists will discuss their past work, their ability to work on the project, their interest in this particular project, and their experience collaborating with communities. The artists who are asked to interview for the project will not be asked to develop a model or proposal.\r\n\r\nArtists may interview with multiple partners, but can only be selected for one project. \r\n\r\nHOW TO APPLY\r\nApplications will only be accepted electronically through Submittable at https://hub-robesongallery.submittable.com/submit.\r\n\r\nApplications must include:\r\n1. A letter no longer than two pages describing why you are interested in this project. Include details about one or two of your experiences collaborating or working with communities. Name the letter using this convention: last name_first name_letter and save the file as a PDF.\r\n2. Work samples of past work, up to 10 images and/or videos. Images should be in JPEG format and videos not longer than 3 minutes. Name work samples with your last name, first name, and numbers 1 – 10. For example: Auerbach_Tauba_01, Auerbach_Tauba_02, etc. TIP: please do not include composite images (multiple images in one file).\r\n3. A script that includes a short description of each image submitted. The description should include, as applicable: artwork title, medium, dimensions, budget (if appropriate), and short summary (if appropriate). Save the file as a PDF and name it using this convention: last name_first name_script.\r\n4. A copy of your artist statement. Save the file as a PDF and name it using this convention: last name_first name_statement\r\n5. A copy of your resume, up to three pages. Save the file as a PDF and name it using this convention: last name_first name_resume\r\n\r\nTIMELINE\r\nFebruary 14, 2019 – RFQ deadline @ 11:59 p.m., E.S.T.\r\nFebruary 21, 2019 – Jury review and selection\r\nMarch 2019 – Selected artists notified\r\nFall 2019 – Project completion/installation\r\n\r\nCONTACT INFORMATION\r\nIf you have questions about this RFQ, please contact Tamryn McDermott, Campus Arts Associate at 814-865-0775 or by email at tlm6018@psu.edu. You can find more information on our website at campusarts.psu.edu and follow us on Instagram @campusarts_psu.", "Description": "Campus Arts Initiative and eight partners from across Penn State’s Commonwealth Campuses are partnering to develop temporary works of public art, one at each partner’s site.  The Pennsylvania State University (Penn State) is one of the country's largest public university systems and Pennsylvania's sole land-grant institution. Penn State's community includes 100,000 students across 24 campuses and 17,000 faculty and staff dedicated to making a positive impact on communities around the world. \r\n\r\nThe projects will result from collaboration between eight artists and the host sites they are partnered with. The exact vision, form, location, installation duration, and materials for the project will be determined by the artist in collaboration with their university partner.\r\n\r\nWe are seeking visual artists or teams that include a visual artist and there are no residency requirements for this opportunity. Professional and emerging artists who are new to the field of public art are encouraged to apply", "timestamp": "2019-01-30 09:36:49"}, "20": {"ID": "ca0f8aeb-4822-4a43-a6b3-0b88f1dd4e26", "url": "https://www.nyfa.org/Opportunities/Show/ca0f8aeb-4822-4a43-a6b3-0b88f1dd4e26", "Title": "Inspired: Contemporary Responses to a Legacy of Courage", "Organization": "Susquehanna Art Museum", "Website": "http://www.SusquehannaArtMuseum.org", "Country": "United States", "Location": "Harrisburg, PA", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": " ", "Application Deadline": "04/04/2019", "Application Instructions": "GUIDELINES\r\n– Submissions are open to all artists. Work must be original, and entries in all media will be considered.\r\n– Artists are responsible for all shipping/transport costs for artwork, should it be accepted\r\n– Submissions must be in digital format, sent to LNye@SusquehannaArtMuseum.org with the subject line Inspired.\r\n– Image file naming must be as follows: LastName,FirstName_TitleOfPiece.jpg (or other standard image file format). All images must be print quality, at least 300 DPI, no larger than 2MB.\r\n– Supporting information that must be included in the body of the submission email or an attached editable document:\r\n– Artist information (artist name, address, phone, email address), full list of submitted works (title, medium, date completed, dimensions, insurance value), and artist statement\r\n– First consideration will be given to works that cite the specific archival item/s that have informed the work of art\r\n– All work must be prepared for exhibition, ready to hang (2D work) or install (3D work). No exceptions.\r\n– By entering the jurying process, the artist agrees to have their work available for the duration of the exhibition and to deliver the original artwork during the agreed-upon dates. The artist grants the organizers permission to photograph works for publicity, educational, and reference purposes.\r\n\r\nQuestions about the submission process? Contact Exhibitions Director Lauren Nye at LNye@SusquehannaArtMuseum.org", "Description": "From Friday May 10 to Sunday August 18, 2019 Susquehanna Art Museum will present Inspired, a juried exhibition in the Lobby Gallery and DeSoto Family Vault.\r\n\r\nJune 28 – July 1, 2019 marks the 50th anniversary of the historic Stonewall uprising. The uprising, a series of violent demonstrations, was a spontaneous moment of courageous activism by members of the LGBTQ+ community against a police raid that took place at the Stonewall Inn in the Greenwich Village. The Stonewall Riots served as a catalyst for the LGBTQ+ rights movement in the United States and around the world. To recognize and commemorate this historic moment, Susquehanna Art Museum is partnering with the LGBT Center of Central PA and Dickinson College Archives and Special Collections to open the LGBTQ+ history project collection to artists and creators. The collection documents the stories and history of LGBTQ+ life and activism in Central PA.\r\nSusquehanna Art Museum’s 2019 juried exhibition provides an opportunity for artists to visit the collection at the Dickinson College Archives and Special Collections (or explore selections from the collection here: bit.ly/2NQsVDw and oral histories here: bit.ly/2Csco6Z). Artists are tasked with creating original works of art inspired by the items in the collection. Works selected for this exhibition should provide a contemporary reflection on a pivotal moment in American LGBTQ+ history. Submissions may consider the history of the LGBTQ+ community, the continued search for equity and inclusion both nationally and globally, social justice for marginalized groups, or other expressions of creativity inspired by the collection. These works may include, but are not limited to: ceramics, mixed media sculpture, painting, drawing, performance, video, the written word, and graphic design.\r\n\r\nThe collection, located in the Waidner-Spahr Library at Dickinson College, will be open to the public on Wednesday, January 16 through Friday, January 18, 2019 from 9am to 4pm and Saturday January 19, 2019 from 1pm to 4pm. During this time, a large amount of the collection will be on display  in the Archives. Staff will be on hand to assist with pulling any other items by request, helping the artists photograph items, etc. Because of the time of year and the possibility of inclement weather, artists should check local media to see if Dickinson is closed on January 16-18. Because the college is not normally open on  Saturday the 19th, there will be no media announcement about a closure. If it looks like inclement weather on that day, the artists should call the Archives at (717) 245-1399 and a message will be on the phone greeting indicating if there is a closure.\r\nInspired is generously sponsored by Ross Kanenson and Marcy Kanenson in memory of their Mother, Marilynn R. Kanenson.\r\n\r\nJURORS\r\n– Barry Loveland, Chair of the LGBT Center of Central PA History Project\r\n– Lauren Nye, Director of Exhibitions, Susquehanna Art Museum\r\n \r\nPRIZE\r\n– Viewer’s Choice- $250, voting takes place at the exhibition\r\n \r\nIMPORTANT DATES \r\n– Thursday, April 4: Deadline for submissions. No late submissions will be reviewed.\r\n– April 29 – May 3: Selected work must be delivered to Susquehanna Art Museum during pre-arranged appointment times.\r\n \r\nFEES\r\n- Submissions to this year’s juried exhibition are FREE to commemorate the unique partnership of Central Pennsylvania organizations.\r\n– Each artist may submit up to 3 pieces.", "timestamp": "2019-01-30 09:36:49"}, "21": {"ID": "a79ac1ba-749e-4284-9bc2-faf5931f2a93", "url": "https://www.nyfa.org/Opportunities/Show/a79ac1ba-749e-4284-9bc2-faf5931f2a93", "Title": "Taking Pictures: 2019", "Organization": "Black Box Gallery", "Website": "http://blackboxgallery.com", "Country": "United States", "Location": "Portland, OR", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "Photography", "Application Fee": "$35.00", "Application Deadline": "02/08/2019", "Application Instructions": "See prospectus on website.", "Description": "A juried group photo show with an open theme at Black Box Gallery.\r\nFor more info: http://blackboxgallery.com", "timestamp": "2019-01-30 09:36:49"}, "22": {"ID": "6c6e7218-1f0b-49ee-97aa-c956b5ace00a", "url": "https://www.nyfa.org/Opportunities/Show/6c6e7218-1f0b-49ee-97aa-c956b5ace00a", "Title": "Call for Artists/Designers", "Organization": "The Southern Vermont Arts Center", "Website": "http://www.svac.org/wilson/", "Country": "United States", "Location": "Manchester, VT", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": " ", "Application Deadline": "03/01/2019", "Application Instructions": "Visit: https://www.svac.org/wilson/ to complete the application. \r\nPlease contact submissions@svac.org with questions. No phone calls please.", "Description": "The Southern Vermont Arts Center (SVAC) is excited to announce their upcoming exhibition, Unusual Threads: Stitching Together the Future of Fashion, opening on May 11, 2019. This exhibition will explore the future of high fashion in conjunction with practices of sustainability using reused/recycled and organic materials. \r\n\r\nSVAC is accepting applications from designers/students/artisans who are creating high-craft/high-fashion, wearable objects (including: garments, accessories, jewelry and/or footwear), or fiber art within the spectrum of reused/recycled or organic materials. \r\n\r\n<u>Applicants can choose from the following options:</u>\r\n\r\n<b>1.\tFashion Show only:</b> \r\n a.\t At least 3-5 pieces per designer/student in the fashion show \r\n\r\n<b>2.\tFashion Show and Exhibition:</b> \r\na.     At least 3-5 pieces per designer/student in the fashion show\r\nb.\tAt least 3-5 pieces per designer/student showcased in the exhibit. \r\n(Note: some of the pieces worn in the fashion show may be used in the exhibition after the fashion show)\r\n \r\n<b>3.\tExhibition only:</b> \r\na.\t5-8 pieces exhibited in the exhibition for the duration of the exhibition.  \r\n\r\nPlease visit our website https://www.svac.org/wilson/ to apply!\r\n\r\n <u>You will be asked to provide the following:</u> \r\n\r\n•\tFull name and contact info (email, address, phone)\r\n\r\n•\tDesigner/Artisan statement (250 words max) explaining pieces/concept\r\n\r\n•\tPortfolio of 3-5 digital images for consideration in the exhibition. Entries may vary from 2-d concepts/drawings, prototypes, or ready-to-wear pieces (entries should be available for purchase)\r\n\r\n•\tDesigner bio/resume. Specify your title (i.e. student/designer), what kind of designs you create and where you work or attend school \r\n\r\n•\tWebsites, digital media, or social media accounts\r\n\r\n•\tPlease indicate which option you are applying for \r\n\r\n<b>The deadline for applications is March 1, 2019.</b>", "timestamp": "2019-01-30 09:36:49"}, "23": {"ID": "76881a8d-18a9-4f1e-875f-7f129098e7bc", "url": "https://www.nyfa.org/Opportunities/Show/76881a8d-18a9-4f1e-875f-7f129098e7bc", "Title": "32nd Annual McNeese National  Works on Paper Exhibition", "Organization": "McNeese State University/Dept. of Visual Arts", "Website": "http://www.mcneeseartonline.org", "Country": "United States", "Location": "Lake Charles, LA", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$35.00", "Application Deadline": "02/14/2019", "Application Instructions": "MEDIA SPECIFICATIONS\r\nWork in any medium using paper as a component part is eligible. Artwork, including frame, should not exceed 40” in any dimension.\r\n\r\nELIGIBILITY\r\nOpen to all artists living in the United States. All artwork should be original and completed in the last two years.\r\n\r\nPRESENTATION\r\nAccepted artwork must be suitable for formal gallery presentation as well as the rigors of packaged shipping.\r\n\r\nENTRIES\r\nArtists may submit no more than three entries. \r\nEntries are submitted using the CaFÉ™ website (www.callforentry.org). \r\nYou may prep your materials in advance by following these specifications:\r\nFile format - JPEG or JPG\r\nFile dimension - minimum 1,200 pixels on the longest side File size - under 5 MB \r\n\r\nENTRY FEE\r\nA non-refundable entry fee of $35 is charged each entrant. \r\nThis fee entitles the artist to a maximum of three entries. \r\nCredit card payments are accepted using the CaFÉ™ website.\r\nEntries will be marked complete upon receipt of payment.\r\nThe prospectus may be copied or downloaded from: www.mcneeseartonline.org\r\n\r\nEXHIBITION\r\nMarch 21 - May 9, 2019\r\nAwards will be announced at the opening reception March 21.\r\nAccepted artworks required to remain in the Grand Gallery for the duration of the exhibition.\r\n\r\nDELIVERY OF ACCEPTED WORK\r\nPlease ship work to:\r\n32nd Annual McNeese National Works on Paper Exhibition\r\nMcNeese State University/Dept. of Visual Arts\r\n4205 Ryan St. \r\nLake Charles, LA 70609\r\n\r\n• Works must be received by March 12.\r\n• C.O.D. deliveries will not be accepted. \r\n• All accepted works must include prepaid return shipping label.\r\n• Late or damaged shipments will be returned collect.\r\n• Works must be shipped in reusable packing cartons.\r\n• NO PACKING POPCORN.\r\n• Hand deliveries accepted March 12-15 (9 a.m. to 4 p.m.).\r\n\r\nRETURN OF ACCEPTED WORKS\r\nReturn of artwork begins:...May 14\r\nHand delivery pick up:.........May 18 (9 a.m. to 4 p.m.)\r\n\r\nLIABILITY\r\nAll reasonable care will be given to objects in the custody of the Department of Visual Arts. Works are insured while on exhibition in the Grand Gallery. The Department of Visual Arts cannot assume responsibility for the damage or deterioration incurred before or after exhibition, or for possible loss in transit.\r\n\r\nSALES & REPRODUCTION\r\nWhile no commission will be charged on purchase prize awards, a 40 percent commission will be charged on all other artists’ sales by the Grand Gallery. The exhibition committee reserves the right to reproduce accepted entries in press releases, catalog and on the website.\r\n\r\n\r\nCONTACT INFORMATION\r\nMcNeese State University, Department of Visual Arts\r\nExhibition Coordinator: Heather Ryan Kelley\r\nPhone: 337-475-5060 (office), 337-475-5927 (fax)\r\nEmail: hkelley@mcneese.edu\r\nMailing address:\r\n32nd Annual McNeese National \r\nWorks on Paper Exhibition\r\nMcNeese State University/Dept. of Visual Arts\r\n4205 Ryan St.\r\nLake Charles, LA 70609", "Description": "JUROR\r\nStephanie Mitchell, Executive Director\r\nLawndale Art Center, Houston, Texas\r\n\r\nCALENDAR 2019\r\nFebruary 14......Deadline for receiving all entry submissions\r\nFebruary 28.....Notification of acceptance\r\nMarch 12.........Deadline for receipt of accepted works\r\nMarch 21.........Opening reception (6 to 8 p.m.)\r\nMay 9..............Exhibition concludes\r\n\r\nAWARDS\r\n$3,000 will be available for the purchase of works for the McNeese State University Works on Paper Permanent Collection.", "timestamp": "2019-01-30 09:36:50"}, "24": {"ID": "e8745af9-6bb1-4c33-bffa-2d9541ce6366", "url": "https://www.nyfa.org/Opportunities/Show/e8745af9-6bb1-4c33-bffa-2d9541ce6366", "Title": "PACKAGED: Call for Works Made Using (or About) Packing Materials", "Organization": "Manifest Creative Research Gallery and Drawing Center", "Website": "http://www.manifestgallery.org/packaged", "Country": "United States", "Location": "Cincinnati, OH", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Disciplines", "Application Fee": "$40.00", "Application Deadline": "02/10/2019", "Application Instructions": "Apply online at http://www.manifestgallery.org/packaged.", "Description": "The Cincinnati based non-profit arts organization and gallery, Manifest, presents an open call for artwork about or made using packing materials.\r\n\r\nThe stuff is all around us, to the point of becoming a global bio-crisis, yet at Manifest we have seen sublime and compelling works of art give new life and meaning to such cast-off materials from time to time. Whether through pure recycling of pre-used materials into new forms, by employing them 'virgin' to create art, or by making more traditional work about them, we invite artists to share works of art focused on, created from, or made about packaging materials of any and all types.\r\n\r\nAll types of work are welcome, including traditional and non-traditional approaches in any media, and any subject, non-objective, abstract, conceptual, etc.\r\n\r\nArtists are encouraged to take a broadly creative view of the theme. The artists we invite to jury our exhibits enjoy surprise, creative solutions, and most of all exceptionally well put together visual art. The bottom line is that work must be by, of, or about packaging materials.\r\n\r\nANNUAL CASH AWARD: The annual Manifest Grand Jury Prize will result in the awarding of one significant cash prize ($2500) to a single work selected as the 'best of the entire season'.", "timestamp": "2019-01-30 09:36:50"}, "25": {"ID": "c6abf004-ac1d-453d-9819-a87118dfe728", "url": "https://www.nyfa.org/Opportunities/Show/c6abf004-ac1d-453d-9819-a87118dfe728", "Title": "DRAWN: An Exhibition of Contemporary Drawing", "Organization": "Manifest Creative Research Gallery and Drawing Center", "Website": "http://www.manifestgallery.org/drawn", "Country": "United States", "Location": "Cincinnati, OH", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Disciplines", "Application Fee": "$40.00", "Application Deadline": "02/08/2019", "Application Instructions": "To view the full prospectus and to apply, visit http://www.manifestgallery.org/drawn.", "Description": "The Cincinnati based non-profit arts organization and gallery, Manifest, presents an open call for artwork exploring contemporary drawing.\r\n\r\nDRAWN seeks to survey and present the broad scope of drawing being made today. This gallery exhibit is completely separate from the annual INDA publication project. Artists are invited to submit works of drawing in any media relevant to the practice (including non-traditional approaches), any style, and any genre (fine art, illustration, design, conceptual, realism, etc.).\r\n\r\nSubmissions can range from the most traditional to the most conceptual or experimental. Past exhibit and book participants are welcome and encouraged to submit.\r\n\r\nANNUAL CASH AWARD: The annual Manifest Grand Jury Prize will result in the awarding of one significant cash prize ($2500) to a single work selected as the 'best of the entire season'.", "timestamp": "2019-01-30 09:36:50"}, "26": {"ID": "e30c6096-7e64-4615-8b0e-3628a55c952f", "url": "https://www.nyfa.org/Opportunities/Show/e30c6096-7e64-4615-8b0e-3628a55c952f", "Title": "Art New England Artist in Residence", "Organization": "Art New England", "Website": "https://opencall.artrepreneur.com/art-new-england-artist-residence/", "Country": "N/A", "Location": " ", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": " ", "Application Deadline": "03/15/2019", "Application Instructions": "Please apply via this link: \r\n\r\nhttps://opencall.artrepreneur.com/art-new-england-artist-residence/", "Description": "Art New England, in celebration of its 40th Anniversary and in collaboration with Artrepreneur, announces an Open Call for an Illustrator/Artist-in-Residence. Three finalists will be chosen, with the winner’s work appearing in three issues of Art New England in 2019 in addition to a $500 cash prize and $300 dollars per issue. Work will help illustrate the Publisher’s Letter and other editorial as needed, with specifics and instructions provided to the artist per issue.", "timestamp": "2019-01-30 09:36:50"}, "27": {"ID": "f6d1d0b2-ae51-4f94-b1b0-006b7ae899cd", "url": "https://www.nyfa.org/Opportunities/Show/f6d1d0b2-ae51-4f94-b1b0-006b7ae899cd", "Title": "CALL TO ARTISTS - NYA gallery | newyorkart.com grand opening group show.", "Organization": "NYA gallery, newyorkart.com", "Website": "http://newyorkart.com", "Country": "United States", "Location": "New York, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$45.00", "Application Deadline": "03/01/2019", "Application Instructions": "log onto newyorkart.com and click on \"Artist Submit\" - application $45.", "Description": "Around for the past 8 years as an iPhone app and website newyorkart.com is opening a 9000 sq ft arts center, with storage, art studios and a white box gallery called NYA gallery in TriBeCa on Broadway.\r\n\r\nTRIBECA ARTS CENTER.\r\n\r\nCALL TO ARTIST -  for a group show for the grand opening happening Thursday, March 7 2019 (6-9pm) (During Armory week)\r\n\r\nSubject: any\r\nMedium: any\r\nSize restriction: under 36\"X48\"\r\n\r\n$45 application fee", "timestamp": "2019-01-30 09:36:50"}, "28": {"ID": "49c95674-9918-434f-b365-1412b1754f39", "url": "https://www.nyfa.org/Opportunities/Show/49c95674-9918-434f-b365-1412b1754f39", "Title": "76th Regional Exhibition Call for Entries", "Organization": "Arnot Art Museum", "Website": "https://76thregional.artcall.org", "Country": "United States", "Location": "Elmira, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$40.00", "Application Deadline": "02/06/2019", "Application Instructions": "The non-refundable entry fee is $40 for one or two entries ($25 for Museum members). You must use the secure website ArtCall.org to participate. Please visit https://76thregional.artcall.org to complete the registration, payment, and submission process by 6 February 2019. Contact engagement@arnotartmuseum.org if you have any questions.", "Description": "The Arnot Art Museum in Elmira, New York announces a call for artists for their 76th Regional Exhibition. Artists must be 18 or older and live in Connecticut, Delaware, Maine, Massachusetts, New Hampshire, New Jersey, New York, Pennsylvania, Rhode Island, or Vermont. Work over five years old or shown before in any Arnot Art Museum exhibition is not eligible. There is a maximum of two entries per artist. Please visit https://76thregional.artcall.org for more information and to submit your entries. \r\n\r\nThe 76th Regional Exhibition offers up to $8,000 in cash awards to be distributed among the juror selections. Work selected for the exhibition will be on display in the Museum's galleries from 15 March through 14 June 2019.", "timestamp": "2019-01-30 09:36:50"}, "29": {"ID": "1fcc05f8-30a2-4e59-9bb2-8d158b02824c", "url": "https://www.nyfa.org/Opportunities/Show/1fcc05f8-30a2-4e59-9bb2-8d158b02824c", "Title": "MvVO ART AD ART SHOW 2019 call for artists on LinkNYC in NY city!", "Organization": "MvVO ART", "Website": "http://www.mvvoart.com", "Country": "United States", "Location": "remsenburg, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$75.00", "Application Deadline": "01/31/2019", "Application Instructions": "Please go to www.mvvoart.com to learn more and apply right from home page or via this direct link:\r\nhttps://mvvoart.submittable.com/submit\r\nfor questions: contact info@mvvoart.com", "Description": "Go to www. mvvoart.com to apply!!\r\n\r\nMvVO ART, creator of AD ART SHOW, is turning the streets of New York’s most art-centric neighborhoods into a revolutionary Art Show, digitally exhibiting contemporary Art on the LinkNYC network on select streets during Frieze Week—May 1 to 4, 2019. \r\n \r\nAD ART SHOW celebrates the ART created by artists currently working in advertising, or with roots in the advertising/design/commercial arts industries, as they follow in the footsteps of Warhol, Magritte, Haring, Dali and the many other world-renowned artists who worked in advertising.\r\n \r\nThe inaugural AD ART SHOW 2018 was a phenomenal success, bringing the Art, Media and Advertising world together for a 4 day show at Sotheby’s with 92 artists from advertising from around the world. AD ART SHOW 2019 transforms the LinkNYC network into an outdoor art show during the biggest week of the City’s art calendar—Frieze Week.\r\n \r\nThe selection committee is made up of contemporary art experts and influential collectors.\r\n \r\nThe Call for Artists submissions is open until January 31, 2019. For more information, eligibility or to submit work to the show, visit www.mvvoart.com", "timestamp": "2019-01-30 09:36:50"}, "30": {"ID": "ccc50f44-2c41-43b5-8369-7a04d00b4d6d", "url": "https://www.nyfa.org/Opportunities/Show/ccc50f44-2c41-43b5-8369-7a04d00b4d6d", "Title": "2-Dimensional Art Open Call", "Organization": "Lost Alphabet", "Website": "http://www.lostalphabet.com/2d-open-call/", "Country": "United States", "Location": "Cheyenne, WY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$10.00", "Application Deadline": "01/31/2019", "Application Instructions": "The last day to submit is 23:59EST, January 31, 2018.\r\n\r\nFiles should be a PDF titled First-Name_Last-Name_2019", "Description": "Lost Alphabet is an international publishing company accepting submissions for artist features in a print and digital book. Each author accepted will get a spread of their work from 2-8 pages. All 2-dimensional work is accepted. Authors must be 18 years or older.", "timestamp": "2019-01-30 09:36:50"}, "31": {"ID": "34d43ebb-8ca8-41b6-8524-1261524e23b8", "url": "https://www.nyfa.org/Opportunities/Show/34d43ebb-8ca8-41b6-8524-1261524e23b8", "Title": "Emerging Curators - OPEN CALL", "Organization": "Local Project", "Website": "http://localproject.org/open-calls/emerging-curators-program-2019/", "Country": "United States", "Location": "Long Island City, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Disciplines", "Application Fee": " ", "Application Deadline": "01/30/2019", "Application Instructions": "Guidelines:\r\n\r\nProposals must include :\r\n-Title of the project, number of artist involved (min 2 – max 10 artists),\r\n-Outline plan for a 2 week exhibition or 1-3 day performance program.\r\n–Programming during the exhibition on view (performance, screening, artist talk/walk, workshop),\r\n-Describe your idea in a simple way and be original – up to 1000 words.\r\n-Include up to 5 images.\r\n-Curator and Artists must be residents of New York City.\r\n-All mediums and ideas are accepted.\r\n-Curators can’t  include their own work in the exhibition.\r\n– Curator must supply all the content for the catalogue, including high res images, artist info and a paragraph about the exhibition etc. \r\n-Only one proposal per curator, curatorial collaborations accepted.\r\n-Selected Curators must be present all the times during installation, opening, programs and closing ceremony, and embrace the DIY mentality of LP, by participating, collaborating and sitting at the gallery.\r\n-Submit a PDF to  opencall@localproject.org with EMERGING CURATORS on the subject line.\r\n-Do NOT send/attach CV/PRESS or any other information not listed here\r\nPlease don’s apply if you where part of the program as a curator in the past.\r\nAny questions email opencall@localproject.org", "Description": "Emerging Curators is an open call invitation to independent curators who may not have had opportunities to present a project to an audience, or first time curators to submit a Project/Exhibition proposal to be part of Local Project’s 2019 exhibition calendar. This program will provide the curator with an exhibition space, guidance in marketing, a stipend and a printed catalog.\r\nExhibitions will be reviewed by a guest curator, we will then select 6 proposals for the year 2019 to happen in the LP gallery and at site specific locations or other galleries in LIC area.\r\nThe Emerging Curators will represent the vision of a new generation.\r\nApplication is FREE.\r\nDEADLINE:\r\nJanuary 30, 5pm, 2019.\r\nNotifications by Feb 14, 2019", "timestamp": "2019-01-30 09:36:51"}, "32": {"ID": "0257b4f2-f035-4aef-9819-4aa6abddcd82", "url": "https://www.nyfa.org/Opportunities/Show/0257b4f2-f035-4aef-9819-4aa6abddcd82", "Title": "Creative Ad Open Call", "Organization": "Artrepreneur", "Website": "https://artrepreneur.com/opencall/creative-ad-open-call", "Country": "United States", "Location": "New York, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "Digital/Electronic Arts", "Application Fee": " ", "Application Deadline": "02/01/2019", "Application Instructions": "Please apply via this link: https://artrepreneur.com/opencall/creative-ad-open-call", "Description": "CALLING ALL GRAPHIC ARTISTS AND COMMERCIAL PHOTOGRAPHERS!\r\n\r\nCreative Circle and Artrepreneur are looking for images to feature in our next ad campaign. Your creative work can be at the center of the national campaign announcing the launch of our collaboration, the CREATIVE CAREER CENTER, a brand-new online destination helping aspiring members of the creative community become Artrepreneurs. We are looking for bold, bright, clean, fresh, modern conceptual images that represent the campaign tagline \"Artrepreneurs Start Here.\"\r\n\r\nFive grand prize winners will receive $250 and other prizes, along with a byline credit for any use of their work. Five runners-up will receive $100 dollar Amazon gift cards.", "timestamp": "2019-01-30 09:36:51"}, "33": {"ID": "997f35e4-5e6c-444b-83a6-412c4b680dd8", "url": "https://www.nyfa.org/Opportunities/Show/997f35e4-5e6c-444b-83a6-412c4b680dd8", "Title": "Call for Artists: The Other Art Fair Brooklyn and Chicago May 2019!", "Organization": "The Other Art Fair", "Website": "http://theotherartfair.com", "Country": "United States", "Location": "New York, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": " ", "Application Deadline": "02/04/2019", "Application Instructions": "**The Other Art Fair Brooklyn** \r\nBrooklyn Expo Center, May 2-5, 2019 \r\nApply online now: http://nyc.theotherartfair.com/applications \r\nDeadline for applications: January 18\r\n\r\n**The Other Art Fair Chicago** \r\nApply online now: http://chicago.theotherartfair.com/applications \r\nDeadline for applications: February 4, 2019\r\nMana Contemporary, May 16-19 2019 \r\n\r\nContact Sasha Ali, sasha@theotherartfair.com, with questions", "Description": "Applications are now open for both The Other Art Fair Brooklyn and Chicago editions this May!!! \r\n\r\n**The Other Art Fair Brooklyn** \r\nBrooklyn Expo Center, May 2-5, 2019 \r\nApply online now: http://nyc.theotherartfair.com/applications \r\nDeadline for applications: January 18\r\n\r\n**The Other Art Fair Chicago** \r\nApply online now: http://chicago.theotherartfair.com/applications \r\nDeadline for applications: February 4, 2019\r\nMana Contemporary, May 16-19 2019 \r\n\r\nThe Other Art Fair provides a unique platform for artists to showcase their work to gallerists, curators, critics and collectors. \r\n\r\nPresented by leading online gallery Saatchi Art, the fair is recognized as the definitive place for buyers to discover exciting and emerging talent. In addition to artwork sales, these four days enable artists to launch their work in the contemporary art world, gauge the public’s response to their pieces and meet fellow artists for potential future collaborations.\r\n\r\nThe most recent edition of The Other Art Fair in Brooklyn in November 2018 welcomed over 12,300 visitors and attracted representatives from many esteemed New York galleries and cultural institutions such as Gagosian Gallery, Pace Gallery, Elizabeth Dee Gallery, The Museum of Modern Art, The Metropolitan Museum of Art and Christie’s. This reception was met with numerous sales, commissions and post fair collaborations.\r\n\r\nThere is no application fee. Stand fees start at $1,680 + sales tax.\r\n\r\nAs part of our exciting collaboration with leading online gallery Saatchi Art, exhibitors will be presented as fair artists to an extensive network of curators, collectors, interior designers and international buyers via saatchiart.com/theotherartfair, social media and the Canvas blog.\r\n\r\nAny questions? Please contact Sasha Ali, Fair Assistant, sasha@theotherartfair.com", "timestamp": "2019-01-30 09:36:51"}, "34": {"ID": "fe652349-3959-47cb-bdc6-ab2f9b528092", "url": "https://www.nyfa.org/Opportunities/Show/fe652349-3959-47cb-bdc6-ab2f9b528092", "Title": "Abstractly Speaking", "Organization": "Woman Made Gallery", "Website": "https://womanmade.org/", "Country": "United States", "Location": "Chicago, IL", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$30.00", "Application Deadline": "01/30/2019", "Application Instructions": "https://womanmade.org/call-for-art/", "Description": "Exhibition Description: \r\nThis call seeks to highlight art which is non representational and unconcerned with literal depiction, instead relying on the visual language of form, color, line, texture, mark-making and process, as a means to an end.\r\n***All mediums welcome.\r\nAll applicants should submit an artist’s statement about their body of work. Accepted artworks must not exceed 72\" horizontally and must not have been previously shown at WMG.  \r\n\r\nJuror: Melanee Cooper, Owner + Director, Melanee Cooper Gallery\r\nWith 22 years of experience as a curator and gallery owner, Melanee Cooper has returned to Chicago to reopen Melanee Cooper Gallery, featuring contemporary emerging and mid career artists locally, nationally and internationally in all mediums.", "timestamp": "2019-01-30 09:36:51"}, "35": {"ID": "dd8cc1f3-8122-4a22-a256-cf7418249efc", "url": "https://www.nyfa.org/Opportunities/Show/dd8cc1f3-8122-4a22-a256-cf7418249efc", "Title": "PAPER 2019", "Organization": "Silvermine Arts Center", "Website": "https://www.silvermineguild.org/paper-2019.html", "Country": "United States", "Location": "New Canaan, CT", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$45.00", "Application Deadline": "02/07/2019", "Application Instructions": "Applications through Slideroom  https://silvermineart.slideroom.com/#/login/program/46817", "Description": "PAPER 2019 exhibition features pieces by artists working in paper broadly considered. Submissions may include prints, drawings, photographs, artists’ books, handmade paper as well as three-dimensional works made with paper. The aim of the exhibition is to highlight the vitality, diversity, sense of experimentation and skillful execution and the many ways in which contemporary artists approach this material.\r\n\r\nCURATOR  \r\nJennifer Farrell, Associate Curator Drawings and Prints, The Metropolitan Museum of Art, NYC. \r\n\r\nAWARDS  \r\nBest in Show, awards an artist a solo exhibition at Silvermine Arts Center with a $1,000 stipend for show related expenses. The Juror has additional awards to give at their discretion.", "timestamp": "2019-01-30 09:36:51"}, "36": {"ID": "2c2d36de-cf4d-4fcb-816c-94c220127edf", "url": "https://www.nyfa.org/Opportunities/Show/2c2d36de-cf4d-4fcb-816c-94c220127edf", "Title": "The Body", "Organization": "Site:Brooklyn", "Website": "http://www.sitebrooklyn.com", "Country": "United States", "Location": "Brooklyn, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$35.00", "Application Deadline": "01/30/2019", "Application Instructions": "https://bit.ly/2GnHq3q", "Description": "The Body\r\nMarch 15, 2019 – April 13, 2019\r\nThis is an open call to artists for an exhibition at Site:Brooklyn Gallery.\r\n\r\nThe human body has inspired artists throughout the ages – it was often used to explore myth and allegory, signify beauty, sexuality, or life itself. The twentieth and twenty-first centuries saw a significant expansion of the importance of the body in art. Bodily representation still acts as a repository for beauty, nature, or religious ideas, but it has also taken on new roles. They bear and sometimes thwart identity, are sites of political and social struggle, and are fragmented or unseen.\r\n\r\nABOUT THE JUROR:\r\nBenjamin Sutton is an art critic, journalist, and curator who lives in Park Slope. He is the News Editor at Artsy and his articles on public art, artist documentaries, the tedium of art fairs, and art crime have appeared there and in Hyperallergic, artnet, Brooklyn Magazine, Art+Auction, and elsewhere. He has curated exhibitions at the Lower East Side Printshop, Field Projects, the Spring Break Art Show, and the Gowanus Loft.\r\n\r\nABOUT THE GALLERY:\r\nSite:Brooklyn Gallery located in Brooklyn, New York is dedicated to exhibiting the current practice of contemporary artists.\r\n \r\nDATES:\r\nCall Announcement: December 15, 2018\r\nFinal Submission Deadline: January 30, 2019\r\nNotification Letter: February 8, 2019\r\nGallery Exhibition: March 15 – April 13, 2019\r\nOpening Reception: Friday, March 15, 2019 from 6-9 PM\r\n \r\nELIGIBILITY:\r\nThis is a juried exhibition for artists working in drawing, painting, printmaking, photography, wall mounted sculpture, collage, and video.\r\nThis exhibition is open to all artists 18 years of age or older.\r\n \r\nSUBMISSIONS AND FEES:\r\nOnly original works may be submitted. The fee is $35.00 for up to three (3) images, $10 for each additional image. If adding additional images please do so prior to check out.\r\nAll entries must be registered/received by January 30, 2019 11:59 PM MT\r\nAll entry fees are non-refundable.\r\n \r\nDIRECTIONS FOR ONLINE SUBMISSION:\r\nhttps://bit.ly/2GnHq3q\r\n\r\nPRESENTATION:\r\n1. Maximum Size: 60” X 60” X 12” D\r\n2. All artwork must be suitably framed to a professional standard. All framed work must use Plexiglas, except hand-delivered work less than 24” x 30”. Assemblage, canvas and wood panels do not require a frame. No clip frames, saw-tooth hangers or taped edges are permitted.\r\n3. Work must be wired or have a cleat attachment and be ready for hanging. A label must be affixed to the back of the work that indicates which end is the top and includes the following: Artist Name, Title, Medium, Dimensions, and Price. This information must correspond with the Accepted image as listed on Notification form. No artwork may be substituted.\r\n 4. Work cannot be withdrawn, nor sales shipped, before the end of the exhibit. \r\n \r\nSHIPPING:\r\nArtists will be responsible for delivery and return shipping of all their artwork. The artist assumes all responsibility for insuring artwork against shipping damage or loss.\r\n \r\nLIABILITY:\r\nSite:Brooklyn is not responsible for any damage, breakage, replacement or cost associated with any damage or breakage that may have occurred during transport or unpacking the work. Every precaution will be taken in handling the work, but Site:Brooklyn assumes no liability for any loss or damage to any artist’s work while in our care, custody or control, before, during or after the exhibition. Each artist, if they wish, needs to provide their own insurance.\r\n \r\nSALES/COMMISSIONS:\r\nAll artwork must be priced for sale.\r\nArtwork cannot be withdrawn, nor sales shipped, before the end of the exhibit.\r\nSite:Brooklyn will retain a 50% commission on all exhibition sales. The price represented on the artist entry form will be the sale price. No changes will be allowed.\r\n \r\nCONTACT/QUESTIONS:\r\nPlease direct all questions to sitebrooklyn@sitebrooklyn.com\r\n \r\nENTRY AGREEMENT:\r\nWith the submission of artwork into the “The Body” Exhibition, the artist agrees to all the terms and conditions set forth in this prospectus.", "timestamp": "2019-01-30 09:36:51"}, "37": {"ID": "63f5e492-fcc1-4402-be84-ad1e6458c7cf", "url": "https://www.nyfa.org/Opportunities/Show/63f5e492-fcc1-4402-be84-ad1e6458c7cf", "Title": "Blue", "Organization": "Site:Brooklyn", "Website": "http://www.sitebrooklyn.com", "Country": "United States", "Location": "Brooklyn, NY", "Opportunity Type": "Call for Entry/Open Call", "Opportunity Discipline": "All Visual Arts", "Application Fee": "$35.00", "Application Deadline": "01/28/2019", "Application Instructions": "DIRECTIONS FOR ONLINE SUBMISSION: https://bit.ly/2rl2Aon", "Description": "Blue\r\nMarch 15, 2019 – April 13, 2019\r\n\r\nThe color blue has an extensive and rich artistic history, exerting its power on humanity’s social, religious, and aesthetic imagination from ancient times onwards. Out of the medieval era, various shades of blue came to signify royalty, religious purity, romance, sadness, and the great expanses of nature. In the 20th century, the rise of monochrome and the advent of space photography further expanded the blue’s aesthetic domain. That being said, what’s new in blue? Our call seeks to further this exploration of color in contemporary practice. Works in traditional and new media are invited, as are the freshest and freest ideas.\r\n\r\nABOUT THE JUROR:\r\nMarcia E. Vetrocq is a visual arts specialist, educator, and editorial consultant who has published extensively on modern and contemporary art. From 1998 she was an editor at the magazine Art in America (editor-in-chief, 2008–2011). She has taught in graduate programs at the University of New Orleans, Columbia University, and Montclair State, and is currently on the adjunct faculty of Pratt’s MFA program. Recent publications in The Brooklyn Rail include reviews of exhibitions by Allison Miller and Hew Locke. She holds degrees in art history from Princeton (BA) and Stanford (PhD).\r\n \r\nABOUT THE GALLERY:\r\nSite:Brooklyn Gallery located in Brooklyn, New York is dedicated to exhibiting the current practice of contemporary artists.\r\n \r\nDATES:\r\nCall Announcement: December 5, 2018\r\nFinal Submission Deadline: January 28, 2019\r\nNotification Letter: February 6, 2019\r\nGallery Exhibition: March 15 – April 13, 2019\r\nOpening Reception: Friday, March 15, 2019 from 6-9 PM\r\n \r\nELIGIBILITY:\r\nThis is a juried exhibition for artists working in drawing, painting, printmaking, photography, wall mounted sculpture, collage, and video.\r\nThis exhibition is open to all artists 18 years of age or older.\r\n \r\nSUBMISSIONS AND FEES:\r\nOnly original works may be submitted. The fee is $35.00 for up to three (3) images, $10 for each additional image. If adding additional images please do so prior to check out.\r\nAll entries must be registered/received by January 28, 2019 11:59 PM MT\r\nAll entry fees are non-refundable.\r\n \r\nDIRECTIONS FOR ONLINE SUBMISSION:\r\nhttps://bit.ly/2rl2Aon\r\n\r\nPRESENTATION:\r\n1. Maximum Size: 60” X 60” X 12” D\r\n2. All artwork must be suitably framed to a professional standard. All framed work must use Plexiglas, except hand-delivered work less than 24” x 30”. Wall mounted sculpture, canvas and wood panels do not require a frame. No clip frames, saw-tooth hangers or taped edges are permitted. Video work must include all equipment.\r\n3. Work must be wired or have a cleat attachment and be ready for hanging. A label must be affixed to the back of the work that indicates which end is the top and includes the following: Artist Name, Title, Medium, Dimensions, and Price. This information must correspond with the Accepted image as listed on Notification form. No artwork may be substituted.\r\n5. Work cannot be withdrawn, nor sales shipped, before the end of the exhibit. \r\n \r\nSHIPPING:\r\nArtists will be responsible for delivery and return shipping of all their artwork. The artist assumes all responsibility for insuring artwork against shipping damage or loss.\r\n \r\nLIABILITY:\r\nSite:Brooklyn is not responsible for any damage, breakage, replacement or cost associated with any damage or breakage that may have occurred during transport or unpacking the work. Every precaution will be taken in handling the work, but Site:Brooklyn assumes no liability for any loss or damage to any artist’s work while in our care, custody or control, before, during or after the exhibition. Each artist, if they wish, needs to provide their own insurance.\r\n \r\nSALES/COMMISSIONS:\r\nAll artwork must be priced for sale.\r\nArtwork cannot be withdrawn, nor sales shipped, before the end of the exhibit.\r\nSite:Brooklyn will retain a 50% commission on all exhibition sales. The price represented on the artist entry form will be the sale price. No changes will be allowed.\r\n \r\nCONTACT/QUESTIONS:\r\nPlease direct all questions to sitebrooklyn@sitebrooklyn.com\r\n \r\nENTRY AGREEMENT:\r\nWith the submission of artwork into the “Blue” Exhibition, the artist agrees to all the terms and conditions set forth in this prospectus.", "timestamp": "2019-01-30 09:36:51"}}}